<?php

return [
    'cities0' => [
        'name' => 'Абаза',
        'lat' => '52.6517296',
        'long' => '90.0885929',
    ],
    'cities1' => [
        'name' => 'Абакан',
        'lat' => '53.7223661',
        'long' => '91.4437792',
    ],
    'cities2' => [
        'name' => 'Абдулино',
        'lat' => '53.6778096',
        'long' => '53.6473115',
    ],
    'cities3' => [
        'name' => 'Абинск',
        'lat' => '44.8679931',
        'long' => '38.1618437',
    ],
    'cities4' => [
        'name' => 'Агидель',
        'lat' => '55.89976',
        'long' => '53.9221149',
    ],
    'cities5' => [
        'name' => 'Агрыз',
        'lat' => '56.5232645',
        'long' => '52.994257',
    ],
    'cities6' => [
        'name' => 'Адыгейск',
        'lat' => '44.8783715',
        'long' => '39.190172',
    ],
    'cities7' => [
        'name' => 'Азнакаево',
        'lat' => '54.8599054',
        'long' => '53.0745505',
    ],
    'cities8' => [
        'name' => 'Азов',
        'lat' => '47.1120631',
        'long' => '39.4232597',
    ],
    'cities9' => [
        'name' => 'Ак-Довурак',
        'lat' => '51.1785658',
        'long' => '90.5984511',
    ],
    'cities10' => [
        'name' => 'Аксай',
        'lat' => '47.2676075',
        'long' => '39.8755485',
    ],
    'cities11' => [
        'name' => 'Алагир',
        'lat' => '43.0416151',
        'long' => '44.2198622',
    ],
    'cities12' => [
        'name' => 'Алапаевск',
        'lat' => '57.8475542',
        'long' => '61.6693934',
    ],
    'cities13' => [
        'name' => 'Алатырь',
        'lat' => '54.8398179',
        'long' => '46.5721423',
    ],
    'cities14' => [
        'name' => 'Алдан',
        'lat' => '58.6094885',
        'long' => '125.3816689',
    ],
    'cities15' => [
        'name' => 'Алейск',
        'lat' => '52.4920914',
        'long' => '82.7794145',
    ],
    'cities16' => [
        'name' => 'Александров',
        'lat' => '56.3919652',
        'long' => '38.711035',
    ],
    'cities17' => [
        'name' => 'Александровск',
        'lat' => '59.1613773',
        'long' => '57.5764851',
    ],
    'cities18' => [
        'name' => 'Александровск-Сахалинский',
        'lat' => '50.8973664',
        'long' => '142.1579322',
    ],
    'cities19' => [
        'name' => 'Алексеевка',
        'lat' => '50.6299932',
        'long' => '38.6881776',
    ],
    'cities20' => [
        'name' => 'Алексин',
        'lat' => '54.5083788',
        'long' => '37.047891',
    ],
    'cities21' => [
        'name' => 'Алзамай',
        'lat' => '55.5550493',
        'long' => '98.6644106',
    ],
    'cities22' => [
        'name' => 'Алушта',
        'lat' => '44.6764419',
        'long' => '34.4100387',
    ],
    'cities23' => [
        'name' => 'Альметьевск',
        'lat' => '54.9013662',
        'long' => '52.2970654',
    ],
    'cities24' => [
        'name' => 'Амурск',
        'lat' => '50.2345017',
        'long' => '136.8791135',
    ],
    'cities25' => [
        'name' => 'Анадырь',
        'lat' => '64.7314347',
        'long' => '177.5015752',
    ],
    'cities26' => [
        'name' => 'Анапа',
        'lat' => '44.8950777',
        'long' => '37.3163142',
    ],
    'cities27' => [
        'name' => 'Ангарск',
        'lat' => '52.5448102',
        'long' => '103.8885385',
    ],
    'cities28' => [
        'name' => 'Андреаполь',
        'lat' => '56.6507072',
        'long' => '32.2621196',
    ],
    'cities29' => [
        'name' => 'Анжеро-Судженск',
        'lat' => '56.0787179',
        'long' => '86.0202207',
    ],
    'cities30' => [
        'name' => 'Анива',
        'lat' => '46.7132526',
        'long' => '142.5265052',
    ],
    'cities31' => [
        'name' => 'Апатиты',
        'lat' => '67.5678295',
        'long' => '33.4067218',
    ],
    'cities32' => [
        'name' => 'Апрелевка',
        'lat' => '55.5276336',
        'long' => '37.0651105',
    ],
    'cities33' => [
        'name' => 'Апшеронск',
        'lat' => '44.4585239',
        'long' => '39.7300092',
    ],
    'cities34' => [
        'name' => 'Арамиль',
        'lat' => '56.6945341',
        'long' => '60.8343825',
    ],
    'cities35' => [
        'name' => 'Аргун',
        'lat' => '43.2918071',
        'long' => '45.8724383',
    ],
    'cities36' => [
        'name' => 'Ардатов',
        'lat' => '54.8465693',
        'long' => '46.2412736',
    ],
    'cities37' => [
        'name' => 'Ардон',
        'lat' => '43.1756719',
        'long' => '44.2955701',
    ],
    'cities38' => [
        'name' => 'Арзамас',
        'lat' => '55.3947544',
        'long' => '43.8407855',
    ],
    'cities39' => [
        'name' => 'Аркадак',
        'lat' => '51.9387813',
        'long' => '43.4997558',
    ],
    'cities40' => [
        'name' => 'Армавир',
        'lat' => '45.0010338',
        'long' => '41.132392',
    ],
    'cities41' => [
        'name' => 'Армянск',
        'lat' => '46.1059247',
        'long' => '33.6910325',
    ],
    'cities42' => [
        'name' => 'Арсеньев',
        'lat' => '44.16208',
        'long' => '133.269622',
    ],
    'cities43' => [
        'name' => 'Арск',
        'lat' => '56.0913636',
        'long' => '49.8770441',
    ],
    'cities44' => [
        'name' => 'Артем',
        'lat' => '43.350053',
        'long' => '132.1596594',
    ],
    'cities45' => [
        'name' => 'Артемовск',
        'lat' => '54.3472901',
        'long' => '93.4356543',
    ],
    'cities46' => [
        'name' => 'Артемовский',
        'lat' => '57.3384162',
        'long' => '61.8946599',
    ],
    'cities47' => [
        'name' => 'Архангельск',
        'lat' => '64.5392985',
        'long' => '40.5170083',
    ],
    'cities48' => [
        'name' => 'Асбест',
        'lat' => '57.0052428',
        'long' => '61.4581071',
    ],
    'cities49' => [
        'name' => 'Асино',
        'lat' => '56.9908444',
        'long' => '86.1765724',
    ],
    'cities50' => [
        'name' => 'Астрахань',
        'lat' => '46.3655808',
        'long' => '48.0559979',
    ],
    'cities51' => [
        'name' => 'Аткарск',
        'lat' => '51.8736331',
        'long' => '45.0003199',
    ],
    'cities52' => [
        'name' => 'Ахтубинск',
        'lat' => '48.2753078',
        'long' => '46.1906741',
    ],
    'cities53' => [
        'name' => 'Ачинск',
        'lat' => '56.2538662',
        'long' => '90.47949',
    ],
    'cities54' => [
        'name' => 'Аша',
        'lat' => '54.9907105',
        'long' => '57.2783704',
    ],
    'cities55' => [
        'name' => 'Бабаево',
        'lat' => '59.389309',
        'long' => '35.9378318',
    ],
    'cities56' => [
        'name' => 'Бабушкин',
        'lat' => '51.7113066',
        'long' => '105.8673633',
    ],
    'cities57' => [
        'name' => 'Бавлы',
        'lat' => '54.4063588',
        'long' => '53.2457946',
    ],
    'cities58' => [
        'name' => 'Багратионовск',
        'lat' => '54.3866976',
        'long' => '20.6418545',
    ],
    'cities59' => [
        'name' => 'Байкальск',
        'lat' => '51.5231282',
        'long' => '104.1485752',
    ],
    'cities60' => [
        'name' => 'Баймак',
        'lat' => '52.5912632',
        'long' => '58.3111995',
    ],
    'cities61' => [
        'name' => 'Бакал',
        'lat' => '54.9406759',
        'long' => '58.8051085',
    ],
    'cities62' => [
        'name' => 'Баксан',
        'lat' => '43.6820621',
        'long' => '43.5345627',
    ],
    'cities63' => [
        'name' => 'Балабаново',
        'lat' => '55.1773652',
        'long' => '36.6567255',
    ],
    'cities64' => [
        'name' => 'Балаково',
        'lat' => '52.0222694',
        'long' => '47.7828146',
    ],
    'cities65' => [
        'name' => 'Балахна',
        'lat' => '56.4949932',
        'long' => '43.5758953',
    ],
    'cities66' => [
        'name' => 'Балашиха',
        'lat' => '55.7963352',
        'long' => '37.9381413',
    ],
    'cities67' => [
        'name' => 'Балашов',
        'lat' => '51.5389502',
        'long' => '43.1839828',
    ],
    'cities68' => [
        'name' => 'Балей',
        'lat' => '51.5822063',
        'long' => '116.6380088',
    ],
    'cities69' => [
        'name' => 'Балтийск',
        'lat' => '54.6514128',
        'long' => '19.9141911',
    ],
    'cities70' => [
        'name' => 'Барабинск',
        'lat' => '55.3515917',
        'long' => '78.3465012',
    ],
    'cities71' => [
        'name' => 'Барнаул',
        'lat' => '53.3481145',
        'long' => '83.7798362',
    ],
    'cities72' => [
        'name' => 'Барыш',
        'lat' => '53.6534563',
        'long' => '47.1180805',
    ],
    'cities73' => [
        'name' => 'Батайск',
        'lat' => '47.138321',
        'long' => '39.7508382',
    ],
    'cities74' => [
        'name' => 'Бахчисарай',
        'lat' => '44.751388',
        'long' => '33.8750341',
    ],
    'cities75' => [
        'name' => 'Бежецк',
        'lat' => '57.7861144',
        'long' => '36.6903445',
    ],
    'cities76' => [
        'name' => 'Белая Калитва',
        'lat' => '48.176948',
        'long' => '40.8033169',
    ],
    'cities77' => [
        'name' => 'Белая Холуница',
        'lat' => '58.8415212',
        'long' => '50.8461002',
    ],
    'cities78' => [
        'name' => 'Белгород',
        'lat' => '50.5977351',
        'long' => '36.5858236',
    ],
    'cities79' => [
        'name' => 'Белебей',
        'lat' => '54.1033832',
        'long' => '54.1111878',
    ],
    'cities80' => [
        'name' => 'Белев',
        'lat' => '53.8113348',
        'long' => '36.1383153',
    ],
    'cities81' => [
        'name' => 'Белинский',
        'lat' => '52.9641169',
        'long' => '43.4185003',
    ],
    'cities82' => [
        'name' => 'Белово',
        'lat' => '54.4221442',
        'long' => '86.3036438',
    ],
    'cities83' => [
        'name' => 'Белогорск',
        'lat' => '50.9212235',
        'long' => '128.4738742',
    ],
    'cities84' => [
        'name' => 'Белогорск',
        'lat' => '45.0571581',
        'long' => '34.5998775',
    ],
    'cities85' => [
        'name' => 'Белозерск',
        'lat' => '60.0307914',
        'long' => '37.7891123',
    ],
    'cities86' => [
        'name' => 'Белокуриха',
        'lat' => '51.9960534',
        'long' => '84.9840343',
    ],
    'cities87' => [
        'name' => 'Беломорск',
        'lat' => '64.5378468',
        'long' => '34.7799717',
    ],
    'cities88' => [
        'name' => 'Белорецк',
        'lat' => '53.9675927',
        'long' => '58.4099562',
    ],
    'cities89' => [
        'name' => 'Белореченск',
        'lat' => '44.7652733',
        'long' => '39.8780457',
    ],
    'cities90' => [
        'name' => 'Белоусово',
        'lat' => '55.0957679',
        'long' => '36.6777239',
    ],
    'cities91' => [
        'name' => 'Белоярский',
        'lat' => '63.712181',
        'long' => '66.6772357',
    ],
    'cities92' => [
        'name' => 'Белый',
        'lat' => '55.8337663',
        'long' => '32.9388976',
    ],
    'cities93' => [
        'name' => 'Бердск',
        'lat' => '54.7582375',
        'long' => '83.1072212',
    ],
    'cities94' => [
        'name' => 'Березники',
        'lat' => '59.4079898',
        'long' => '56.8040725',
    ],
    'cities95' => [
        'name' => 'Березовский',
        'lat' => '55.6692853',
        'long' => '86.2744636',
    ],
    'cities96' => [
        'name' => 'Березовский',
        'lat' => '56.9096284',
        'long' => '60.8180256',
    ],
    'cities97' => [
        'name' => 'Беслан',
        'lat' => '43.1937634',
        'long' => '44.5338746',
    ],
    'cities98' => [
        'name' => 'Бийск',
        'lat' => '52.5393683',
        'long' => '85.2138852',
    ],
    'cities99' => [
        'name' => 'Бикин',
        'lat' => '46.8186244',
        'long' => '134.2551046',
    ],
    'cities100' => [
        'name' => 'Билибино',
        'lat' => '68.0585533',
        'long' => '166.4388451',
    ],
    'cities101' => [
        'name' => 'Биробиджан',
        'lat' => '48.7945975',
        'long' => '132.9217594',
    ],
    'cities102' => [
        'name' => 'Бирск',
        'lat' => '55.4157107',
        'long' => '55.5582335',
    ],
    'cities103' => [
        'name' => 'Бирюсинск',
        'lat' => '55.9608611',
        'long' => '97.8203624',
    ],
    'cities104' => [
        'name' => 'Бирюч',
        'lat' => '50.6483899',
        'long' => '38.4006203',
    ],
    'cities105' => [
        'name' => 'Благовещенск',
        'lat' => '50.2905935',
        'long' => '127.5272186',
    ],
    'cities106' => [
        'name' => 'Благовещенск',
        'lat' => '55.0499592',
        'long' => '55.955309',
    ],
    'cities107' => [
        'name' => 'Благодарный',
        'lat' => '45.0990834',
        'long' => '43.4307042',
    ],
    'cities108' => [
        'name' => 'Бобров',
        'lat' => '51.0902048',
        'long' => '40.0320014',
    ],
    'cities109' => [
        'name' => 'Богданович',
        'lat' => '56.7764419',
        'long' => '62.0463692',
    ],
    'cities110' => [
        'name' => 'Богородицк',
        'lat' => '53.7700516',
        'long' => '38.1225308',
    ],
    'cities111' => [
        'name' => 'Богородск',
        'lat' => '56.1019905',
        'long' => '43.513678',
    ],
    'cities112' => [
        'name' => 'Боготол',
        'lat' => '56.209881',
        'long' => '89.5300182',
    ],
    'cities113' => [
        'name' => 'Богучар',
        'lat' => '49.9352997',
        'long' => '40.5592467',
    ],
    'cities114' => [
        'name' => 'Бодайбо',
        'lat' => '57.8468822',
        'long' => '114.1867148',
    ],
    'cities115' => [
        'name' => 'Бокситогорск',
        'lat' => '59.4735032',
        'long' => '33.8456521',
    ],
    'cities116' => [
        'name' => 'Болгар',
        'lat' => '54.9748862',
        'long' => '49.0302977',
    ],
    'cities117' => [
        'name' => 'Бологое',
        'lat' => '57.885655',
        'long' => '34.0536895',
    ],
    'cities118' => [
        'name' => 'Болотное',
        'lat' => '55.6693773',
        'long' => '84.3906599',
    ],
    'cities119' => [
        'name' => 'Болохово',
        'lat' => '54.0820644',
        'long' => '37.826844',
    ],
    'cities120' => [
        'name' => 'Болхов',
        'lat' => '53.4440204',
        'long' => '36.0076969',
    ],
    'cities121' => [
        'name' => 'Большой Камень',
        'lat' => '43.1112737',
        'long' => '132.3480354',
    ],
    'cities122' => [
        'name' => 'Бор',
        'lat' => '56.3565179',
        'long' => '44.0644851',
    ],
    'cities123' => [
        'name' => 'Борзя',
        'lat' => '50.3875437',
        'long' => '116.5235682',
    ],
    'cities124' => [
        'name' => 'Борисоглебск',
        'lat' => '51.3654619',
        'long' => '42.100947',
    ],
    'cities125' => [
        'name' => 'Боровичи',
        'lat' => '58.3839866',
        'long' => '33.9176761',
    ],
    'cities126' => [
        'name' => 'Боровск',
        'lat' => '55.2130965',
        'long' => '36.4927446',
    ],
    'cities127' => [
        'name' => 'Бородино',
        'lat' => '55.9054308',
        'long' => '94.9021138',
    ],
    'cities128' => [
        'name' => 'Братск',
        'lat' => '56.1513951',
        'long' => '101.6339892',
    ],
    'cities129' => [
        'name' => 'Бронницы',
        'lat' => '55.4255534',
        'long' => '38.2640794',
    ],
    'cities130' => [
        'name' => 'Брянск',
        'lat' => '53.2420071',
        'long' => '34.3652716',
    ],
    'cities131' => [
        'name' => 'Бугульма',
        'lat' => '54.5363428',
        'long' => '52.7895286',
    ],
    'cities132' => [
        'name' => 'Бугуруслан',
        'lat' => '53.6522636',
        'long' => '52.4326166',
    ],
    'cities133' => [
        'name' => 'Буденновск',
        'lat' => '44.7814437',
        'long' => '44.1650859',
    ],
    'cities134' => [
        'name' => 'Бузулук',
        'lat' => '52.7881434',
        'long' => '52.2623757',
    ],
    'cities135' => [
        'name' => 'Буинск',
        'lat' => '54.9641106',
        'long' => '48.2900576',
    ],
    'cities136' => [
        'name' => 'Буй',
        'lat' => '58.473445',
        'long' => '41.5306746',
    ],
    'cities137' => [
        'name' => 'Буйнакск',
        'lat' => '42.8213799',
        'long' => '47.1164452',
    ],
    'cities138' => [
        'name' => 'Бутурлиновка',
        'lat' => '50.8313227',
        'long' => '40.5977541',
    ],
    'cities139' => [
        'name' => 'Валдай',
        'lat' => '57.9822906',
        'long' => '33.2369492',
    ],
    'cities140' => [
        'name' => 'Валуйки',
        'lat' => '50.2112799',
        'long' => '38.0998765',
    ],
    'cities141' => [
        'name' => 'Велиж',
        'lat' => '55.6058845',
        'long' => '31.1857376',
    ],
    'cities142' => [
        'name' => 'Великие Луки',
        'lat' => '56.3321847',
        'long' => '30.550757',
    ],
    'cities143' => [
        'name' => 'Великий Новгород',
        'lat' => '58.5214003',
        'long' => '31.2755051',
    ],
    'cities144' => [
        'name' => 'Великий Устюг',
        'lat' => '60.7603243',
        'long' => '46.3053893',
    ],
    'cities145' => [
        'name' => 'Вельск',
        'lat' => '61.0660057',
        'long' => '42.1032858',
    ],
    'cities146' => [
        'name' => 'Венев',
        'lat' => '54.3542431',
        'long' => '38.2642325',
    ],
    'cities147' => [
        'name' => 'Верещагино',
        'lat' => '58.0797908',
        'long' => '54.6580948',
    ],
    'cities148' => [
        'name' => 'Верея',
        'lat' => '55.3674668',
        'long' => '36.1563083',
    ],
    'cities149' => [
        'name' => 'Верхнеуральск',
        'lat' => '53.8760587',
        'long' => '59.2169071',
    ],
    'cities150' => [
        'name' => 'Верхний Тагил',
        'lat' => '57.3762768',
        'long' => '59.9516521',
    ],
    'cities151' => [
        'name' => 'Верхний Уфалей',
        'lat' => '56.0487252',
        'long' => '60.231963',
    ],
    'cities152' => [
        'name' => 'Верхняя Пышма',
        'lat' => '56.9757833',
        'long' => '60.564885',
    ],
    'cities153' => [
        'name' => 'Верхняя Салда',
        'lat' => '58.0466039',
        'long' => '60.5560397',
    ],
    'cities154' => [
        'name' => 'Верхняя Тура',
        'lat' => '58.3643839',
        'long' => '59.8266854',
    ],
    'cities155' => [
        'name' => 'Верхотурье',
        'lat' => '58.8621145',
        'long' => '60.8104543',
    ],
    'cities156' => [
        'name' => 'Верхоянск',
        'lat' => '67.5500865',
        'long' => '133.3907829',
    ],
    'cities157' => [
        'name' => 'Весьегонск',
        'lat' => '58.6584004',
        'long' => '37.2568605',
    ],
    'cities158' => [
        'name' => 'Ветлуга',
        'lat' => '57.8558395',
        'long' => '45.7762692',
    ],
    'cities159' => [
        'name' => 'Видное',
        'lat' => '55.5518323',
        'long' => '37.7062062',
    ],
    'cities160' => [
        'name' => 'Вилюйск',
        'lat' => '63.7517314',
        'long' => '121.6272754',
    ],
    'cities161' => [
        'name' => 'Вилючинск',
        'lat' => '52.930428',
        'long' => '158.4057276',
    ],
    'cities162' => [
        'name' => 'Вихоревка',
        'lat' => '56.1207708',
        'long' => '101.170332',
    ],
    'cities163' => [
        'name' => 'Вичуга',
        'lat' => '57.2044545',
        'long' => '41.9131192',
    ],
    'cities164' => [
        'name' => 'Владивосток',
        'lat' => '43.1163807',
        'long' => '131.882348',
    ],
    'cities165' => [
        'name' => 'Владикавказ',
        'lat' => '43.0205039',
        'long' => '44.6819383',
    ],
    'cities166' => [
        'name' => 'Владимир',
        'lat' => '56.1281561',
        'long' => '40.4082995',
    ],
    'cities167' => [
        'name' => 'Волгоград',
        'lat' => '48.7072005',
        'long' => '44.5170207',
    ],
    'cities168' => [
        'name' => 'Волгодонск',
        'lat' => '47.5165181',
        'long' => '42.1984531',
    ],
    'cities169' => [
        'name' => 'Волгореченск',
        'lat' => '57.4423712',
        'long' => '41.1593076',
    ],
    'cities170' => [
        'name' => 'Волжск',
        'lat' => '55.8622987',
        'long' => '48.371553',
    ],
    'cities171' => [
        'name' => 'Волжский',
        'lat' => '48.7978483',
        'long' => '44.7462417',
    ],
    'cities172' => [
        'name' => 'Вологда',
        'lat' => '59.2484186',
        'long' => '39.8356461',
    ],
    'cities173' => [
        'name' => 'Володарск',
        'lat' => '56.2168974',
        'long' => '43.1597623',
    ],
    'cities174' => [
        'name' => 'Волоколамск',
        'lat' => '56.0358121',
        'long' => '35.9585027',
    ],
    'cities175' => [
        'name' => 'Волосово',
        'lat' => '59.4445107',
        'long' => '29.492277',
    ],
    'cities176' => [
        'name' => 'Волхов',
        'lat' => '59.9006057',
        'long' => '32.35212',
    ],
    'cities177' => [
        'name' => 'Волчанск',
        'lat' => '59.9350515',
        'long' => '60.0797964',
    ],
    'cities178' => [
        'name' => 'Вольск',
        'lat' => '52.0459932',
        'long' => '47.3873504',
    ],
    'cities179' => [
        'name' => 'Воркута',
        'lat' => '67.4973484',
        'long' => '64.0611045',
    ],
    'cities180' => [
        'name' => 'Воронеж',
        'lat' => '51.6592378',
        'long' => '39.1968284',
    ],
    'cities181' => [
        'name' => 'Ворсма',
        'lat' => '55.9900425',
        'long' => '43.2719879',
    ],
    'cities182' => [
        'name' => 'Воскресенск',
        'lat' => '55.3071305',
        'long' => '38.7026949',
    ],
    'cities183' => [
        'name' => 'Воткинск',
        'lat' => '57.0517641',
        'long' => '53.9874635',
    ],
    'cities184' => [
        'name' => 'Всеволожск',
        'lat' => '60.0190094',
        'long' => '30.6455834',
    ],
    'cities185' => [
        'name' => 'Вуктыл',
        'lat' => '63.8615209',
        'long' => '57.3165207',
    ],
    'cities186' => [
        'name' => 'Выборг',
        'lat' => '60.7130748',
        'long' => '28.7328813',
    ],
    'cities187' => [
        'name' => 'Выкса',
        'lat' => '55.3207103',
        'long' => '42.1679169',
    ],
    'cities188' => [
        'name' => 'Высоковск',
        'lat' => '56.336141',
        'long' => '36.5251316',
    ],
    'cities189' => [
        'name' => 'Высоцк',
        'lat' => '60.6296511',
        'long' => '28.5709914',
    ],
    'cities190' => [
        'name' => 'Вытегра',
        'lat' => '61.0064157',
        'long' => '36.4495835',
    ],
    'cities191' => [
        'name' => 'Вышний Волочек',
        'lat' => '57.5683326',
        'long' => '34.5402931',
    ],
    'cities192' => [
        'name' => 'Вяземский',
        'lat' => '47.5354416',
        'long' => '134.7553701',
    ],
    'cities193' => [
        'name' => 'Вязники',
        'lat' => '56.2976528',
        'long' => '42.2687311',
    ],
    'cities194' => [
        'name' => 'Вязьма',
        'lat' => '55.2115563',
        'long' => '34.2951196',
    ],
    'cities195' => [
        'name' => 'Вятские Поляны',
        'lat' => '56.2286058',
        'long' => '51.0614666',
    ],
    'cities196' => [
        'name' => 'Гаврилов Посад',
        'lat' => '56.5585967',
        'long' => '40.1228288',
    ],
    'cities197' => [
        'name' => 'Гаврилов-Ям',
        'lat' => '57.3091552',
        'long' => '39.8545157',
    ],
    'cities198' => [
        'name' => 'Гагарин',
        'lat' => '55.5526532',
        'long' => '34.9949049',
    ],
    'cities199' => [
        'name' => 'Гаджиево',
        'lat' => '69.2490009',
        'long' => '33.3152445',
    ],
    'cities200' => [
        'name' => 'Гай',
        'lat' => '51.4649138',
        'long' => '58.4436189',
    ],
    'cities201' => [
        'name' => 'Галич',
        'lat' => '58.3826861',
        'long' => '42.3654563',
    ],
    'cities202' => [
        'name' => 'Гатчина',
        'lat' => '59.5650861',
        'long' => '30.1281859',
    ],
    'cities203' => [
        'name' => 'Гвардейск',
        'lat' => '54.6588981',
        'long' => '21.0500584',
    ],
    'cities204' => [
        'name' => 'Гдов',
        'lat' => '58.7432585',
        'long' => '27.8263328',
    ],
    'cities205' => [
        'name' => 'Геленджик',
        'lat' => '44.5631053',
        'long' => '38.0790184',
    ],
    'cities206' => [
        'name' => 'Георгиевск',
        'lat' => '44.1486421',
        'long' => '43.4739718',
    ],
    'cities207' => [
        'name' => 'Глазов',
        'lat' => '58.1359111',
        'long' => '52.6634998',
    ],
    'cities208' => [
        'name' => 'Голицыно',
        'lat' => '55.6189762',
        'long' => '36.9855559',
    ],
    'cities209' => [
        'name' => 'Горбатов',
        'lat' => '56.1307901',
        'long' => '43.0626829',
    ],
    'cities210' => [
        'name' => 'Горно-Алтайск',
        'lat' => '51.9582681',
        'long' => '85.9602957',
    ],
    'cities211' => [
        'name' => 'Горнозаводск',
        'lat' => '58.3743406',
        'long' => '58.3230329',
    ],
    'cities212' => [
        'name' => 'Горняк',
        'lat' => '50.9979032',
        'long' => '81.4643059',
    ],
    'cities213' => [
        'name' => 'Городец',
        'lat' => '56.6447459',
        'long' => '43.4722975',
    ],
    'cities214' => [
        'name' => 'Городище',
        'lat' => '53.2727888',
        'long' => '45.702731',
    ],
    'cities215' => [
        'name' => 'Городовиковск',
        'lat' => '46.0875351',
        'long' => '41.9354039',
    ],
    'cities216' => [
        'name' => 'Гороховец',
        'lat' => '56.2021059',
        'long' => '42.692517',
    ],
    'cities217' => [
        'name' => 'Горячий Ключ',
        'lat' => '44.6343251',
        'long' => '39.1356421',
    ],
    'cities218' => [
        'name' => 'Грайворон',
        'lat' => '50.4862699',
        'long' => '35.6662957',
    ],
    'cities219' => [
        'name' => 'Гремячинск',
        'lat' => '58.5625603',
        'long' => '57.8520073',
    ],
    'cities220' => [
        'name' => 'Грозный',
        'lat' => '43.3179243',
        'long' => '45.6981102',
    ],
    'cities221' => [
        'name' => 'Грязи',
        'lat' => '52.4873931',
        'long' => '39.9331785',
    ],
    'cities222' => [
        'name' => 'Грязовец',
        'lat' => '58.8757657',
        'long' => '40.248477',
    ],
    'cities223' => [
        'name' => 'Губаха',
        'lat' => '58.837024',
        'long' => '57.5544441',
    ],
    'cities224' => [
        'name' => 'Губкин',
        'lat' => '51.2836362',
        'long' => '37.5347608',
    ],
    'cities225' => [
        'name' => 'Губкинский',
        'lat' => '64.4456575',
        'long' => '76.4714559',
    ],
    'cities226' => [
        'name' => 'Гудермес',
        'lat' => '43.3519164',
        'long' => '46.1036052',
    ],
    'cities227' => [
        'name' => 'Гуково',
        'lat' => '48.0449422',
        'long' => '39.9484635',
    ],
    'cities228' => [
        'name' => 'Гулькевичи',
        'lat' => '45.3605769',
        'long' => '40.6918484',
    ],
    'cities229' => [
        'name' => 'Гурьевск',
        'lat' => '54.7705368',
        'long' => '20.6039109',
    ],
    'cities230' => [
        'name' => 'Гурьевск',
        'lat' => '54.2860005',
        'long' => '85.947723',
    ],
    'cities231' => [
        'name' => 'Гусев',
        'lat' => '54.5915477',
        'long' => '22.1944114',
    ],
    'cities232' => [
        'name' => 'Гусиноозерск',
        'lat' => '51.2865751',
        'long' => '106.5230732',
    ],
    'cities233' => [
        'name' => 'Гусь-Хрустальный',
        'lat' => '55.6198065',
        'long' => '40.6578769',
    ],
    'cities234' => [
        'name' => 'Давлеканово',
        'lat' => '54.2227617',
        'long' => '55.0313419',
    ],
    'cities235' => [
        'name' => 'Дагестанские Огни',
        'lat' => '42.1151021',
        'long' => '48.1939983',
    ],
    'cities236' => [
        'name' => 'Далматово',
        'lat' => '56.2621393',
        'long' => '62.9387378',
    ],
    'cities237' => [
        'name' => 'Дальнегорск',
        'lat' => '44.5539909',
        'long' => '135.5662536',
    ],
    'cities238' => [
        'name' => 'Дальнереченск',
        'lat' => '45.9307882',
        'long' => '133.7316542',
    ],
    'cities239' => [
        'name' => 'Данилов',
        'lat' => '58.1859542',
        'long' => '40.1796765',
    ],
    'cities240' => [
        'name' => 'Данков',
        'lat' => '53.25769',
        'long' => '39.1457625',
    ],
    'cities241' => [
        'name' => 'Дегтярск',
        'lat' => '56.7048199',
        'long' => '60.0792227',
    ],
    'cities242' => [
        'name' => 'Дедовск',
        'lat' => '55.8704718',
        'long' => '37.1244724',
    ],
    'cities243' => [
        'name' => 'Демидов',
        'lat' => '55.2682611',
        'long' => '31.5062078',
    ],
    'cities244' => [
        'name' => 'Дербент',
        'lat' => '42.058935',
        'long' => '48.2908653',
    ],
    'cities245' => [
        'name' => 'Десногорск',
        'lat' => '54.1465117',
        'long' => '33.2834063',
    ],
    'cities246' => [
        'name' => 'Джанкой',
        'lat' => '45.7092436',
        'long' => '34.388332',
    ],
    'cities247' => [
        'name' => 'Дзержинск',
        'lat' => '56.2376438',
        'long' => '43.4599363',
    ],
    'cities248' => [
        'name' => 'Дзержинский',
        'lat' => '55.6241079',
        'long' => '37.8440691',
    ],
    'cities249' => [
        'name' => 'Дивногорск',
        'lat' => '55.9577868',
        'long' => '92.380085',
    ],
    'cities250' => [
        'name' => 'Дигора',
        'lat' => '43.1567386',
        'long' => '44.1551132',
    ],
    'cities251' => [
        'name' => 'Димитровград',
        'lat' => '54.2168446',
        'long' => '49.6261645',
    ],
    'cities252' => [
        'name' => 'Дмитриев',
        'lat' => '52.1269291',
        'long' => '35.0739504',
    ],
    'cities253' => [
        'name' => 'Дмитров',
        'lat' => '56.3477176',
        'long' => '37.5267184',
    ],
    'cities254' => [
        'name' => 'Дмитровск',
        'lat' => '52.5053481',
        'long' => '35.141535',
    ],
    'cities255' => [
        'name' => 'Дно',
        'lat' => '57.8269802',
        'long' => '29.9629569',
    ],
    'cities256' => [
        'name' => 'Добрянка',
        'lat' => '58.4696353',
        'long' => '56.4131294',
    ],
    'cities257' => [
        'name' => 'Долгопрудный',
        'lat' => '55.9384901',
        'long' => '37.5100527',
    ],
    'cities258' => [
        'name' => 'Долинск',
        'lat' => '47.3255903',
        'long' => '142.7945985',
    ],
    'cities259' => [
        'name' => 'Домодедово',
        'lat' => '55.4363901',
        'long' => '37.7666263',
    ],
    'cities260' => [
        'name' => 'Донецк',
        'lat' => '48.3350928',
        'long' => '39.9460654',
    ],
    'cities261' => [
        'name' => 'Донской',
        'lat' => '53.9679582',
        'long' => '38.3372104',
    ],
    'cities262' => [
        'name' => 'Дорогобуж',
        'lat' => '54.9137794',
        'long' => '33.3024596',
    ],
    'cities263' => [
        'name' => 'Дрезна',
        'lat' => '55.7442991',
        'long' => '38.8499228',
    ],
    'cities264' => [
        'name' => 'Дубна',
        'lat' => '56.7417949',
        'long' => '37.1757163',
    ],
    'cities265' => [
        'name' => 'Дубовка',
        'lat' => '49.0555342',
        'long' => '44.8270813',
    ],
    'cities266' => [
        'name' => 'Дудинка',
        'lat' => '69.4031339',
        'long' => '86.1908135',
    ],
    'cities267' => [
        'name' => 'Духовщина',
        'lat' => '55.1950509',
        'long' => '32.4012351',
    ],
    'cities268' => [
        'name' => 'Дюртюли',
        'lat' => '55.4848047',
        'long' => '54.8524875',
    ],
    'cities269' => [
        'name' => 'Дятьково',
        'lat' => '53.5958283',
        'long' => '34.355092',
    ],
    'cities270' => [
        'name' => 'Евпатория',
        'lat' => '45.1904322',
        'long' => '33.3667685',
    ],
    'cities271' => [
        'name' => 'Егорьевск',
        'lat' => '55.3831326',
        'long' => '39.0358236',
    ],
    'cities272' => [
        'name' => 'Ейск',
        'lat' => '46.7114611',
        'long' => '38.2764915',
    ],
    'cities273' => [
        'name' => 'Екатеринбург',
        'lat' => '56.8386326',
        'long' => '60.6054887',
    ],
    'cities274' => [
        'name' => 'Елабуга',
        'lat' => '55.7566727',
        'long' => '52.0544438',
    ],
    'cities275' => [
        'name' => 'Елец',
        'lat' => '52.6151738',
        'long' => '38.5289121',
    ],
    'cities276' => [
        'name' => 'Елизово',
        'lat' => '53.1829573',
        'long' => '158.3882833',
    ],
    'cities277' => [
        'name' => 'Ельня',
        'lat' => '54.5836832',
        'long' => '33.1749566',
    ],
    'cities278' => [
        'name' => 'Еманжелинск',
        'lat' => '54.7554084',
        'long' => '61.3243985',
    ],
    'cities279' => [
        'name' => 'Емва',
        'lat' => '62.5965314',
        'long' => '50.8731889',
    ],
    'cities280' => [
        'name' => 'Енисейск',
        'lat' => '58.4485234',
        'long' => '92.165237',
    ],
    'cities281' => [
        'name' => 'Ермолино',
        'lat' => '55.1972714',
        'long' => '36.5951966',
    ],
    'cities282' => [
        'name' => 'Ершов',
        'lat' => '51.3508407',
        'long' => '48.2763313',
    ],
    'cities283' => [
        'name' => 'Ессентуки',
        'lat' => '44.044461',
        'long' => '42.8589078',
    ],
    'cities284' => [
        'name' => 'Ефремов',
        'lat' => '53.1465725',
        'long' => '38.0922412',
    ],
    'cities285' => [
        'name' => 'Железноводск',
        'lat' => '44.1320689',
        'long' => '43.0306475',
    ],
    'cities286' => [
        'name' => 'Железногорск',
        'lat' => '56.2529346',
        'long' => '93.532167',
    ],
    'cities287' => [
        'name' => 'Железногорск',
        'lat' => '52.3378753',
        'long' => '35.3516834',
    ],
    'cities288' => [
        'name' => 'Железногорск-Илимский',
        'lat' => '56.5847382',
        'long' => '104.1141747',
    ],
    'cities289' => [
        'name' => 'Жердевка',
        'lat' => '51.8421783',
        'long' => '41.4617407',
    ],
    'cities290' => [
        'name' => 'Жигулевск',
        'lat' => '53.4011545',
        'long' => '49.494529',
    ],
    'cities291' => [
        'name' => 'Жиздра',
        'lat' => '53.7522384',
        'long' => '34.7386719',
    ],
    'cities292' => [
        'name' => 'Жирновск',
        'lat' => '50.9767561',
        'long' => '44.7857694',
    ],
    'cities293' => [
        'name' => 'Жуков',
        'lat' => '55.0301386',
        'long' => '36.7393279',
    ],
    'cities294' => [
        'name' => 'Жуковка',
        'lat' => '53.5341219',
        'long' => '33.7302166',
    ],
    'cities295' => [
        'name' => 'Жуковский',
        'lat' => '55.5998408',
        'long' => '38.1224185',
    ],
    'cities296' => [
        'name' => 'Завитинск',
        'lat' => '50.1064678',
        'long' => '129.4392897',
    ],
    'cities297' => [
        'name' => 'Заводоуковск',
        'lat' => '56.5012193',
        'long' => '66.5505094',
    ],
    'cities298' => [
        'name' => 'Заволжск',
        'lat' => '57.4916546',
        'long' => '42.1374455',
    ],
    'cities299' => [
        'name' => 'Заволжье',
        'lat' => '56.6404237',
        'long' => '43.3871565',
    ],
    'cities300' => [
        'name' => 'Задонск',
        'lat' => '52.4004611',
        'long' => '38.9205772',
    ],
    'cities301' => [
        'name' => 'Заинск',
        'lat' => '55.2988854',
        'long' => '52.0063634',
    ],
    'cities302' => [
        'name' => 'Закаменск',
        'lat' => '50.3726774',
        'long' => '103.2867452',
    ],
    'cities303' => [
        'name' => 'Заозерный',
        'lat' => '55.9617268',
        'long' => '94.7091037',
    ],
    'cities304' => [
        'name' => 'Заозерск',
        'lat' => '69.4003895',
        'long' => '32.4502225',
    ],
    'cities305' => [
        'name' => 'Западная Двина',
        'lat' => '56.2568002',
        'long' => '32.0805972',
    ],
    'cities306' => [
        'name' => 'Заполярный',
        'lat' => '69.413232',
        'long' => '30.7985332',
    ],
    'cities307' => [
        'name' => 'Зарайск',
        'lat' => '54.7625993',
        'long' => '38.8851485',
    ],
    'cities308' => [
        'name' => 'Заречный',
        'lat' => '53.1961009',
        'long' => '45.1691502',
    ],
    'cities309' => [
        'name' => 'Заречный',
        'lat' => '56.8103345',
        'long' => '61.3380592',
    ],
    'cities310' => [
        'name' => 'Заринск',
        'lat' => '53.7063495',
        'long' => '84.9314703',
    ],
    'cities311' => [
        'name' => 'Звенигово',
        'lat' => '55.9739374',
        'long' => '48.0170276',
    ],
    'cities312' => [
        'name' => 'Звенигород',
        'lat' => '55.7296168',
        'long' => '36.8552843',
    ],
    'cities313' => [
        'name' => 'Зверево',
        'lat' => '48.043451',
        'long' => '40.1264948',
    ],
    'cities314' => [
        'name' => 'Зеленогорск',
        'lat' => '56.1133001',
        'long' => '94.5888736',
    ],
    'cities315' => [
        'name' => 'Зеленоградск',
        'lat' => '54.9600226',
        'long' => '20.4753274',
    ],
    'cities316' => [
        'name' => 'Зеленодольск',
        'lat' => '55.8466751',
        'long' => '48.5010882',
    ],
    'cities317' => [
        'name' => 'Зеленокумск',
        'lat' => '44.403359',
        'long' => '43.8841326',
    ],
    'cities318' => [
        'name' => 'Зерноград',
        'lat' => '46.8494991',
        'long' => '40.312765',
    ],
    'cities319' => [
        'name' => 'Зея',
        'lat' => '53.7339151',
        'long' => '127.2658079',
    ],
    'cities320' => [
        'name' => 'Зима',
        'lat' => '53.9206865',
        'long' => '102.0492066',
    ],
    'cities321' => [
        'name' => 'Златоуст',
        'lat' => '55.1715695',
        'long' => '59.6726264',
    ],
    'cities322' => [
        'name' => 'Злынка',
        'lat' => '52.4265906',
        'long' => '31.7360386',
    ],
    'cities323' => [
        'name' => 'Змеиногорск',
        'lat' => '51.1580235',
        'long' => '82.1872476',
    ],
    'cities324' => [
        'name' => 'Знаменск',
        'lat' => '48.5865618',
        'long' => '45.7367908',
    ],
    'cities325' => [
        'name' => 'Зубцов',
        'lat' => '56.1760709',
        'long' => '34.5825504',
    ],
    'cities326' => [
        'name' => 'Зуевка',
        'lat' => '58.4031674',
        'long' => '51.1330787',
    ],
    'cities327' => [
        'name' => 'Ивангород',
        'lat' => '59.3765845',
        'long' => '28.2230504',
    ],
    'cities328' => [
        'name' => 'Иваново',
        'lat' => '56.9994677',
        'long' => '40.9728231',
    ],
    'cities329' => [
        'name' => 'Ивантеевка',
        'lat' => '55.9742303',
        'long' => '37.9208755',
    ],
    'cities330' => [
        'name' => 'Ивдель',
        'lat' => '60.6944353',
        'long' => '60.4244661',
    ],
    'cities331' => [
        'name' => 'Игарка',
        'lat' => '67.4667947',
        'long' => '86.5814287',
    ],
    'cities332' => [
        'name' => 'Ижевск',
        'lat' => '56.8527444',
        'long' => '53.2113961',
    ],
    'cities333' => [
        'name' => 'Избербаш',
        'lat' => '42.565098',
        'long' => '47.871002',
    ],
    'cities334' => [
        'name' => 'Изобильный',
        'lat' => '45.3684342',
        'long' => '41.7086448',
    ],
    'cities335' => [
        'name' => 'Иланский',
        'lat' => '56.2374163',
        'long' => '96.0672656',
    ],
    'cities336' => [
        'name' => 'Инза',
        'lat' => '53.8550467',
        'long' => '46.3532786',
    ],
    'cities337' => [
        'name' => 'Инкерман',
        'lat' => '44.6135153',
        'long' => '33.6100739',
    ],
    'cities338' => [
        'name' => 'Иннополис',
        'lat' => '55.7521544',
        'long' => '48.7446161',
    ],
    'cities339' => [
        'name' => 'Инсар',
        'lat' => '53.8770384',
        'long' => '44.3696866',
    ],
    'cities340' => [
        'name' => 'Инта',
        'lat' => '66.0368196',
        'long' => '60.1154612',
    ],
    'cities341' => [
        'name' => 'Ипатово',
        'lat' => '45.7181897',
        'long' => '42.8969695',
    ],
    'cities342' => [
        'name' => 'Ирбит',
        'lat' => '57.6838406',
        'long' => '63.0576639',
    ],
    'cities343' => [
        'name' => 'Иркутск',
        'lat' => '52.2863513',
        'long' => '104.280655',
    ],
    'cities344' => [
        'name' => 'Исилькуль',
        'lat' => '54.9096156',
        'long' => '71.2816107',
    ],
    'cities345' => [
        'name' => 'Искитим',
        'lat' => '54.6266869',
        'long' => '83.2951444',
    ],
    'cities346' => [
        'name' => 'Истра',
        'lat' => '55.9061087',
        'long' => '36.8600854',
    ],
    'cities347' => [
        'name' => 'Ишим',
        'lat' => '56.0952037',
        'long' => '69.4643292',
    ],
    'cities348' => [
        'name' => 'Ишимбай',
        'lat' => '53.4546314',
        'long' => '56.043874',
    ],
    'cities349' => [
        'name' => 'Йошкар-Ола',
        'lat' => '56.6343763',
        'long' => '47.8998445',
    ],
    'cities350' => [
        'name' => 'Кадников',
        'lat' => '59.5037947',
        'long' => '40.3440473',
    ],
    'cities351' => [
        'name' => 'Казань',
        'lat' => '55.7943877',
        'long' => '49.1115312',
    ],
    'cities352' => [
        'name' => 'Калач',
        'lat' => '50.4241213',
        'long' => '41.0162858',
    ],
    'cities353' => [
        'name' => 'Калачинск',
        'lat' => '55.0598547',
        'long' => '74.5655075',
    ],
    'cities354' => [
        'name' => 'Калач-на-Дону',
        'lat' => '48.6887569',
        'long' => '43.5306866',
    ],
    'cities355' => [
        'name' => 'Калининград',
        'lat' => '54.7073218',
        'long' => '20.5072458',
    ],
    'cities356' => [
        'name' => 'Калининск',
        'lat' => '51.4992917',
        'long' => '44.4710177',
    ],
    'cities357' => [
        'name' => 'Калтан',
        'lat' => '53.5210461',
        'long' => '87.2772143',
    ],
    'cities358' => [
        'name' => 'Калуга',
        'lat' => '54.5060439',
        'long' => '36.2515933',
    ],
    'cities359' => [
        'name' => 'Калязин',
        'lat' => '57.2579471',
        'long' => '37.7821253',
    ],
    'cities360' => [
        'name' => 'Камбарка',
        'lat' => '56.2659745',
        'long' => '54.1934153',
    ],
    'cities361' => [
        'name' => 'Каменка',
        'lat' => '53.1855474',
        'long' => '44.0468501',
    ],
    'cities362' => [
        'name' => 'Каменногорск',
        'lat' => '60.9508768',
        'long' => '29.1308061',
    ],
    'cities363' => [
        'name' => 'Каменск-Уральский',
        'lat' => '56.4149095',
        'long' => '61.9189837',
    ],
    'cities364' => [
        'name' => 'Каменск-Шахтинский',
        'lat' => '48.3204412',
        'long' => '40.268874',
    ],
    'cities365' => [
        'name' => 'Камень-на-Оби',
        'lat' => '53.7915454',
        'long' => '81.3545173',
    ],
    'cities366' => [
        'name' => 'Камешково',
        'lat' => '56.3488712',
        'long' => '40.9955682',
    ],
    'cities367' => [
        'name' => 'Камызяк',
        'lat' => '46.1105429',
        'long' => '48.0732724',
    ],
    'cities368' => [
        'name' => 'Камышин',
        'lat' => '50.0651261',
        'long' => '45.3843816',
    ],
    'cities369' => [
        'name' => 'Камышлов',
        'lat' => '56.8465469',
        'long' => '62.7120432',
    ],
    'cities370' => [
        'name' => 'Канаш',
        'lat' => '55.5069543',
        'long' => '47.4917734',
    ],
    'cities371' => [
        'name' => 'Кандалакша',
        'lat' => '67.1567298',
        'long' => '32.4142303',
    ],
    'cities372' => [
        'name' => 'Канск',
        'lat' => '56.2049776',
        'long' => '95.7051246',
    ],
    'cities373' => [
        'name' => 'Карабаново',
        'lat' => '56.3133447',
        'long' => '38.7034267',
    ],
    'cities374' => [
        'name' => 'Карабаш',
        'lat' => '55.4852076',
        'long' => '60.2358959',
    ],
    'cities375' => [
        'name' => 'Карабулак',
        'lat' => '43.3054762',
        'long' => '44.9094521',
    ],
    'cities376' => [
        'name' => 'Карасук',
        'lat' => '53.7343772',
        'long' => '78.042457',
    ],
    'cities377' => [
        'name' => 'Карачаевск',
        'lat' => '43.773197',
        'long' => '41.9143726',
    ],
    'cities378' => [
        'name' => 'Карачев',
        'lat' => '53.1297194',
        'long' => '34.9887859',
    ],
    'cities379' => [
        'name' => 'Каргат',
        'lat' => '55.1943829',
        'long' => '80.2831324',
    ],
    'cities380' => [
        'name' => 'Каргополь',
        'lat' => '61.5008762',
        'long' => '38.9636415',
    ],
    'cities381' => [
        'name' => 'Карпинск',
        'lat' => '59.7664444',
        'long' => '60.0011798',
    ],
    'cities382' => [
        'name' => 'Карталы',
        'lat' => '53.0536101',
        'long' => '60.647712',
    ],
    'cities383' => [
        'name' => 'Касимов',
        'lat' => '54.9373788',
        'long' => '41.3912912',
    ],
    'cities384' => [
        'name' => 'Касли',
        'lat' => '55.8868045',
        'long' => '60.7422529',
    ],
    'cities385' => [
        'name' => 'Каспийск',
        'lat' => '42.8916599',
        'long' => '47.6366674',
    ],
    'cities386' => [
        'name' => 'Катав-Ивановск',
        'lat' => '54.7520187',
        'long' => '58.1983706',
    ],
    'cities387' => [
        'name' => 'Катайск',
        'lat' => '56.2908118',
        'long' => '62.5800669',
    ],
    'cities388' => [
        'name' => 'Качканар',
        'lat' => '58.7051759',
        'long' => '59.4840198',
    ],
    'cities389' => [
        'name' => 'Кашин',
        'lat' => '57.3600486',
        'long' => '37.6118674',
    ],
    'cities390' => [
        'name' => 'Кашира',
        'lat' => '54.8534263',
        'long' => '38.1903818',
    ],
    'cities391' => [
        'name' => 'Кедровый',
        'lat' => '57.5618465',
        'long' => '79.5678914',
    ],
    'cities392' => [
        'name' => 'Кемерово',
        'lat' => '55.3909721',
        'long' => '86.0467864',
    ],
    'cities393' => [
        'name' => 'Кемь',
        'lat' => '64.9543657',
        'long' => '34.5948547',
    ],
    'cities394' => [
        'name' => 'Керчь',
        'lat' => '45.3561128',
        'long' => '36.4674285',
    ],
    'cities395' => [
        'name' => 'Кизел',
        'lat' => '59.0511764',
        'long' => '57.6471214',
    ],
    'cities396' => [
        'name' => 'Кизилюрт',
        'lat' => '43.2039094',
        'long' => '46.8729311',
    ],
    'cities397' => [
        'name' => 'Кизляр',
        'lat' => '43.8483915',
        'long' => '46.7232828',
    ],
    'cities398' => [
        'name' => 'Кимовск',
        'lat' => '53.9698378',
        'long' => '38.5380267',
    ],
    'cities399' => [
        'name' => 'Кимры',
        'lat' => '56.873359',
        'long' => '37.3557064',
    ],
    'cities400' => [
        'name' => 'Кингисепп',
        'lat' => '59.3739407',
        'long' => '28.6112981',
    ],
    'cities401' => [
        'name' => 'Кинель',
        'lat' => '53.2209985',
        'long' => '50.6343039',
    ],
    'cities402' => [
        'name' => 'Кинешма',
        'lat' => '57.4425441',
        'long' => '42.1690039',
    ],
    'cities403' => [
        'name' => 'Киреевск',
        'lat' => '53.9321173',
        'long' => '37.9220791',
    ],
    'cities404' => [
        'name' => 'Киренск',
        'lat' => '57.7757126',
        'long' => '108.1107766',
    ],
    'cities405' => [
        'name' => 'Киржач',
        'lat' => '56.1485263',
        'long' => '38.8635035',
    ],
    'cities406' => [
        'name' => 'Кириллов',
        'lat' => '59.8590353',
        'long' => '38.3749854',
    ],
    'cities407' => [
        'name' => 'Кириши',
        'lat' => '59.4742626',
        'long' => '32.0625536',
    ],
    'cities408' => [
        'name' => 'Киров',
        'lat' => '54.0790823',
        'long' => '34.3077508',
    ],
    'cities409' => [
        'name' => 'Киров',
        'lat' => '58.6035313',
        'long' => '49.6679219',
    ],
    'cities410' => [
        'name' => 'Кировград',
        'lat' => '57.4298451',
        'long' => '60.0623588',
    ],
    'cities411' => [
        'name' => 'Кирово-Чепецк',
        'lat' => '58.5559921',
        'long' => '50.0317608',
    ],
    'cities412' => [
        'name' => 'Кировск',
        'lat' => '59.875371',
        'long' => '30.9815205',
    ],
    'cities413' => [
        'name' => 'Кировск',
        'lat' => '67.6150979',
        'long' => '33.6637196',
    ],
    'cities414' => [
        'name' => 'Кирс',
        'lat' => '59.3400586',
        'long' => '52.2415895',
    ],
    'cities415' => [
        'name' => 'Кирсанов',
        'lat' => '52.650594',
        'long' => '42.7284872',
    ],
    'cities416' => [
        'name' => 'Киселевск',
        'lat' => '54.0060382',
        'long' => '86.6367387',
    ],
    'cities417' => [
        'name' => 'Кисловодск',
        'lat' => '43.905235',
        'long' => '42.7167187',
    ],
    'cities418' => [
        'name' => 'Клин',
        'lat' => '56.3424886',
        'long' => '36.7240912',
    ],
    'cities419' => [
        'name' => 'Клинцы',
        'lat' => '52.7529052',
        'long' => '32.2339161',
    ],
    'cities420' => [
        'name' => 'Княгинино',
        'lat' => '55.8205157',
        'long' => '45.0322947',
    ],
    'cities421' => [
        'name' => 'Ковдор',
        'lat' => '67.5661466',
        'long' => '30.4742082',
    ],
    'cities422' => [
        'name' => 'Ковров',
        'lat' => '56.3553895',
        'long' => '41.3169568',
    ],
    'cities423' => [
        'name' => 'Ковылкино',
        'lat' => '54.0391464',
        'long' => '43.9191229',
    ],
    'cities424' => [
        'name' => 'Когалым',
        'lat' => '62.2638914',
        'long' => '74.4828687',
    ],
    'cities425' => [
        'name' => 'Кодинск',
        'lat' => '58.6033961',
        'long' => '99.1797563',
    ],
    'cities426' => [
        'name' => 'Козельск',
        'lat' => '54.0348417',
        'long' => '35.7807136',
    ],
    'cities427' => [
        'name' => 'Козловка',
        'lat' => '55.8406526',
        'long' => '48.2579372',
    ],
    'cities428' => [
        'name' => 'Козьмодемьянск',
        'lat' => '56.333346',
        'long' => '46.5466282',
    ],
    'cities429' => [
        'name' => 'Кола',
        'lat' => '68.8785079',
        'long' => '33.0262014',
    ],
    'cities430' => [
        'name' => 'Кологрив',
        'lat' => '58.826988',
        'long' => '44.3185323',
    ],
    'cities431' => [
        'name' => 'Коломна',
        'lat' => '55.1027797',
        'long' => '38.7531734',
    ],
    'cities432' => [
        'name' => 'Колпашево',
        'lat' => '58.3114716',
        'long' => '82.9027528',
    ],
    'cities433' => [
        'name' => 'Кольчугино',
        'lat' => '56.3327616',
        'long' => '39.391201',
    ],
    'cities434' => [
        'name' => 'Коммунар',
        'lat' => '59.6215929',
        'long' => '30.393466',
    ],
    'cities435' => [
        'name' => 'Комсомольск',
        'lat' => '57.0273907',
        'long' => '40.3775952',
    ],
    'cities436' => [
        'name' => 'Комсомольск-на-Амуре',
        'lat' => '50.550011',
        'long' => '137.0079286',
    ],
    'cities437' => [
        'name' => 'Конаково',
        'lat' => '56.7275533',
        'long' => '36.8011699',
    ],
    'cities438' => [
        'name' => 'Кондопога',
        'lat' => '62.2059866',
        'long' => '34.2681778',
    ],
    'cities439' => [
        'name' => 'Кондрово',
        'lat' => '54.796051',
        'long' => '35.9276099',
    ],
    'cities440' => [
        'name' => 'Константиновск',
        'lat' => '47.5773456',
        'long' => '41.0967362',
    ],
    'cities441' => [
        'name' => 'Копейск',
        'lat' => '55.1167545',
        'long' => '61.6180809',
    ],
    'cities442' => [
        'name' => 'Кораблино',
        'lat' => '53.9245422',
        'long' => '40.0227867',
    ],
    'cities443' => [
        'name' => 'Кореновск',
        'lat' => '45.4640868',
        'long' => '39.4590178',
    ],
    'cities444' => [
        'name' => 'Коркино',
        'lat' => '54.8903023',
        'long' => '61.4034541',
    ],
    'cities445' => [
        'name' => 'Королев',
        'lat' => '55.9162558',
        'long' => '37.8545224',
    ],
    'cities446' => [
        'name' => 'Короча',
        'lat' => '50.8130123',
        'long' => '37.1896543',
    ],
    'cities447' => [
        'name' => 'Корсаков',
        'lat' => '46.6323995',
        'long' => '142.7994094',
    ],
    'cities448' => [
        'name' => 'Коряжма',
        'lat' => '61.2885993',
        'long' => '47.1002315',
    ],
    'cities449' => [
        'name' => 'Костерево',
        'lat' => '55.9336424',
        'long' => '39.624822',
    ],
    'cities450' => [
        'name' => 'Костомукша',
        'lat' => '64.5889946',
        'long' => '30.6015567',
    ],
    'cities451' => [
        'name' => 'Кострома',
        'lat' => '57.8029445',
        'long' => '40.9907282',
    ],
    'cities452' => [
        'name' => 'Котельники',
        'lat' => '55.659898',
        'long' => '37.8632865',
    ],
    'cities453' => [
        'name' => 'Котельниково',
        'lat' => '47.6310808',
        'long' => '43.1331198',
    ],
    'cities454' => [
        'name' => 'Котельнич',
        'lat' => '58.3035238',
        'long' => '48.3474288',
    ],
    'cities455' => [
        'name' => 'Котлас',
        'lat' => '61.2529842',
        'long' => '46.6331915',
    ],
    'cities456' => [
        'name' => 'Котово',
        'lat' => '50.3205433',
        'long' => '44.8031864',
    ],
    'cities457' => [
        'name' => 'Котовск',
        'lat' => '52.592393',
        'long' => '41.5102486',
    ],
    'cities458' => [
        'name' => 'Кохма',
        'lat' => '56.9325151',
        'long' => '41.0933071',
    ],
    'cities459' => [
        'name' => 'Красавино',
        'lat' => '60.9613991',
        'long' => '46.481465',
    ],
    'cities460' => [
        'name' => 'Красноармейск',
        'lat' => '51.0268595',
        'long' => '45.7011086',
    ],
    'cities461' => [
        'name' => 'Красноармейск',
        'lat' => '51.0236026',
        'long' => '45.695141',
    ],
    'cities462' => [
        'name' => 'Красновишерск',
        'lat' => '60.3902242',
        'long' => '57.0537244',
    ],
    'cities463' => [
        'name' => 'Красногорск',
        'lat' => '55.8318475',
        'long' => '37.32942',
    ],
    'cities464' => [
        'name' => 'Краснодар',
        'lat' => '45.040235',
        'long' => '38.9760801',
    ],
    'cities465' => [
        'name' => 'Краснозаводск',
        'lat' => '56.4408723',
        'long' => '38.2320671',
    ],
    'cities466' => [
        'name' => 'Краснознаменск',
        'lat' => '54.9452612',
        'long' => '22.4928511',
    ],
    'cities467' => [
        'name' => 'Краснознаменск',
        'lat' => '55.5978962',
        'long' => '37.0395137',
    ],
    'cities468' => [
        'name' => 'Краснокаменск',
        'lat' => '50.092858',
        'long' => '118.0323407',
    ],
    'cities469' => [
        'name' => 'Краснокамск',
        'lat' => '58.0820946',
        'long' => '55.7479797',
    ],
    'cities470' => [
        'name' => 'Красноперекопск',
        'lat' => '45.9537956',
        'long' => '33.7921523',
    ],
    'cities471' => [
        'name' => 'Краснослободск',
        'lat' => '48.7068777',
        'long' => '44.5631799',
    ],
    'cities472' => [
        'name' => 'Краснослободск',
        'lat' => '54.4248634',
        'long' => '43.7845096',
    ],
    'cities473' => [
        'name' => 'Краснотурьинск',
        'lat' => '59.7636934',
        'long' => '60.1934451',
    ],
    'cities474' => [
        'name' => 'Красноуральск',
        'lat' => '58.3486334',
        'long' => '60.0409011',
    ],
    'cities475' => [
        'name' => 'Красноуфимск',
        'lat' => '56.6122864',
        'long' => '57.7636958',
    ],
    'cities476' => [
        'name' => 'Красноярск',
        'lat' => '56.009466',
        'long' => '92.8524162',
    ],
    'cities477' => [
        'name' => 'Красный Кут',
        'lat' => '50.9596867',
        'long' => '46.9712472',
    ],
    'cities478' => [
        'name' => 'Красный Сулин',
        'lat' => '47.8830826',
        'long' => '40.0781385',
    ],
    'cities479' => [
        'name' => 'Красный Холм',
        'lat' => '58.0570193',
        'long' => '37.1125975',
    ],
    'cities480' => [
        'name' => 'Кременки',
        'lat' => '54.8863306',
        'long' => '37.116878',
    ],
    'cities481' => [
        'name' => 'Кропоткин',
        'lat' => '45.4332464',
        'long' => '40.5727852',
    ],
    'cities482' => [
        'name' => 'Крымск',
        'lat' => '44.9344108',
        'long' => '37.9855314',
    ],
    'cities483' => [
        'name' => 'Кстово',
        'lat' => '56.1433353',
        'long' => '44.1665081',
    ],
    'cities484' => [
        'name' => 'Кубинка',
        'lat' => '55.5755679',
        'long' => '36.6952487',
    ],
    'cities485' => [
        'name' => 'Кувандык',
        'lat' => '51.4784845',
        'long' => '57.3612029',
    ],
    'cities486' => [
        'name' => 'Кувшиново',
        'lat' => '57.0263733',
        'long' => '34.1676435',
    ],
    'cities487' => [
        'name' => 'Кудымкар',
        'lat' => '59.0168605',
        'long' => '54.6573459',
    ],
    'cities488' => [
        'name' => 'Кузнецк',
        'lat' => '53.1131686',
        'long' => '46.6052497',
    ],
    'cities489' => [
        'name' => 'Куйбышев',
        'lat' => '55.4684104',
        'long' => '78.3241042',
    ],
    'cities490' => [
        'name' => 'Кулебаки',
        'lat' => '55.429716',
        'long' => '42.512483',
    ],
    'cities491' => [
        'name' => 'Кумертау',
        'lat' => '52.7565537',
        'long' => '55.7969915',
    ],
    'cities492' => [
        'name' => 'Кунгур',
        'lat' => '57.4283217',
        'long' => '56.9437787',
    ],
    'cities493' => [
        'name' => 'Купино',
        'lat' => '54.3660317',
        'long' => '77.2972969',
    ],
    'cities494' => [
        'name' => 'Курган',
        'lat' => '55.4443448',
        'long' => '65.3161339',
    ],
    'cities495' => [
        'name' => 'Курганинск',
        'lat' => '44.8876442',
        'long' => '40.5913858',
    ],
    'cities496' => [
        'name' => 'Курильск',
        'lat' => '45.2271915',
        'long' => '147.8796713',
    ],
    'cities497' => [
        'name' => 'Курлово',
        'lat' => '55.4525994',
        'long' => '40.6124362',
    ],
    'cities498' => [
        'name' => 'Куровское',
        'lat' => '55.5791491',
        'long' => '38.9208543',
    ],
    'cities499' => [
        'name' => 'Курск',
        'lat' => '51.7303391',
        'long' => '36.1926448',
    ],
    'cities500' => [
        'name' => 'Куртамыш',
        'lat' => '54.9368491',
        'long' => '64.4203009',
    ],
    'cities501' => [
        'name' => 'Курчатов',
        'lat' => '51.6605475',
        'long' => '35.6571711',
    ],
    'cities502' => [
        'name' => 'Куса',
        'lat' => '55.3385156',
        'long' => '59.4386474',
    ],
    'cities503' => [
        'name' => 'Кушва',
        'lat' => '58.2825406',
        'long' => '59.7646113',
    ],
    'cities504' => [
        'name' => 'Кызыл',
        'lat' => '51.7191542',
        'long' => '94.4377234',
    ],
    'cities505' => [
        'name' => 'Кыштым',
        'lat' => '55.7060048',
        'long' => '60.5563271',
    ],
    'cities506' => [
        'name' => 'Кяхта',
        'lat' => '50.3466291',
        'long' => '106.4534938',
    ],
    'cities507' => [
        'name' => 'Лабинск',
        'lat' => '44.6353153',
        'long' => '40.724385',
    ],
    'cities508' => [
        'name' => 'Лабытнанги',
        'lat' => '66.6592376',
        'long' => '66.3882628',
    ],
    'cities509' => [
        'name' => 'Лагань',
        'lat' => '45.3929617',
        'long' => '47.3432943',
    ],
    'cities510' => [
        'name' => 'Ладушкин',
        'lat' => '54.5693538',
        'long' => '20.1691909',
    ],
    'cities511' => [
        'name' => 'Лаишево',
        'lat' => '55.4042646',
        'long' => '49.5498201',
    ],
    'cities512' => [
        'name' => 'Лакинск',
        'lat' => '56.0180614',
        'long' => '39.9564706',
    ],
    'cities513' => [
        'name' => 'Лангепас',
        'lat' => '61.2536667',
        'long' => '75.1807905',
    ],
    'cities514' => [
        'name' => 'Лахденпохья',
        'lat' => '61.5189466',
        'long' => '30.199592',
    ],
    'cities515' => [
        'name' => 'Лебедянь',
        'lat' => '53.0156678',
        'long' => '39.143498',
    ],
    'cities516' => [
        'name' => 'Лениногорск',
        'lat' => '54.5966917',
        'long' => '52.4432118',
    ],
    'cities517' => [
        'name' => 'Ленинск',
        'lat' => '48.6936234',
        'long' => '45.1992835',
    ],
    'cities518' => [
        'name' => 'Ленинск-Кузнецкий',
        'lat' => '54.6674092',
        'long' => '86.1796724',
    ],
    'cities519' => [
        'name' => 'Ленск',
        'lat' => '60.7276036',
        'long' => '114.9549103',
    ],
    'cities520' => [
        'name' => 'Лермонтов',
        'lat' => '44.1052526',
        'long' => '42.9731433',
    ],
    'cities521' => [
        'name' => 'Лесной',
        'lat' => '58.634981',
        'long' => '59.7980528',
    ],
    'cities522' => [
        'name' => 'Лесозаводск',
        'lat' => '45.4780192',
        'long' => '133.4185501',
    ],
    'cities523' => [
        'name' => 'Лесосибирск',
        'lat' => '58.2218201',
        'long' => '92.5036986',
    ],
    'cities524' => [
        'name' => 'Ливны',
        'lat' => '52.4285122',
        'long' => '37.603944',
    ],
    'cities525' => [
        'name' => 'Ликино-Дулево',
        'lat' => '55.7078531',
        'long' => '38.9577103',
    ],
    'cities526' => [
        'name' => 'Липецк',
        'lat' => '52.6103027',
        'long' => '39.5946266',
    ],
    'cities527' => [
        'name' => 'Липки',
        'lat' => '53.9418109',
        'long' => '37.7019452',
    ],
    'cities528' => [
        'name' => 'Лиски',
        'lat' => '50.9944734',
        'long' => '39.518302',
    ],
    'cities529' => [
        'name' => 'Лихославль',
        'lat' => '57.122256',
        'long' => '35.4667886',
    ],
    'cities530' => [
        'name' => 'Лобня',
        'lat' => '56.0328745',
        'long' => '37.4614671',
    ],
    'cities531' => [
        'name' => 'Лодейное Поле',
        'lat' => '60.7320564',
        'long' => '33.5522225',
    ],
    'cities532' => [
        'name' => 'Лосино-Петровский',
        'lat' => '55.8714441',
        'long' => '38.2005377',
    ],
    'cities533' => [
        'name' => 'Луга',
        'lat' => '58.7373818',
        'long' => '29.8466657',
    ],
    'cities534' => [
        'name' => 'Луза',
        'lat' => '60.6290781',
        'long' => '47.2612069',
    ],
    'cities535' => [
        'name' => 'Лукоянов',
        'lat' => '55.0327349',
        'long' => '44.4933829',
    ],
    'cities536' => [
        'name' => 'Луховицы',
        'lat' => '54.9651617',
        'long' => '39.0261346',
    ],
    'cities537' => [
        'name' => 'Лысково',
        'lat' => '56.0262298',
        'long' => '45.0356702',
    ],
    'cities538' => [
        'name' => 'Лысьва',
        'lat' => '58.0995987',
        'long' => '57.8085728',
    ],
    'cities539' => [
        'name' => 'Лыткарино',
        'lat' => '55.5778065',
        'long' => '37.9034952',
    ],
    'cities540' => [
        'name' => 'Льгов',
        'lat' => '51.6596935',
        'long' => '35.2611592',
    ],
    'cities541' => [
        'name' => 'Любань',
        'lat' => '59.3492573',
        'long' => '31.2485276',
    ],
    'cities542' => [
        'name' => 'Люберцы',
        'lat' => '55.700416',
        'long' => '37.9606496',
    ],
    'cities543' => [
        'name' => 'Любим',
        'lat' => '58.3619868',
        'long' => '40.6869581',
    ],
    'cities544' => [
        'name' => 'Людиново',
        'lat' => '53.8701406',
        'long' => '34.4385498',
    ],
    'cities545' => [
        'name' => 'Лянтор',
        'lat' => '61.6391639',
        'long' => '72.1793828',
    ],
    'cities546' => [
        'name' => 'Магадан',
        'lat' => '59.5681763',
        'long' => '150.8085289',
    ],
    'cities547' => [
        'name' => 'Магас',
        'lat' => '43.1686967',
        'long' => '44.8130849',
    ],
    'cities548' => [
        'name' => 'Магнитогорск',
        'lat' => '53.4071891',
        'long' => '58.9791432',
    ],
    'cities549' => [
        'name' => 'Майкоп',
        'lat' => '44.6098268',
        'long' => '40.1006527',
    ],
    'cities550' => [
        'name' => 'Майский',
        'lat' => '43.6281779',
        'long' => '44.0516663',
    ],
    'cities551' => [
        'name' => 'Макаров',
        'lat' => '48.6236287',
        'long' => '142.7803508',
    ],
    'cities552' => [
        'name' => 'Макарьев',
        'lat' => '57.8808916',
        'long' => '43.8014428',
    ],
    'cities553' => [
        'name' => 'Макушино',
        'lat' => '55.2154025',
        'long' => '67.2452558',
    ],
    'cities554' => [
        'name' => 'Малая Вишера',
        'lat' => '58.8458076',
        'long' => '32.2247984',
    ],
    'cities555' => [
        'name' => 'Малгобек',
        'lat' => '43.5097009',
        'long' => '44.5901517',
    ],
    'cities556' => [
        'name' => 'Малмыж',
        'lat' => '56.5243722',
        'long' => '50.6782757',
    ],
    'cities557' => [
        'name' => 'Малоархангельск',
        'lat' => '52.4001151',
        'long' => '36.5037931',
    ],
    'cities558' => [
        'name' => 'Малоярославец',
        'lat' => '55.0176756',
        'long' => '36.4632122',
    ],
    'cities559' => [
        'name' => 'Мамадыш',
        'lat' => '55.7149876',
        'long' => '51.4128614',
    ],
    'cities560' => [
        'name' => 'Мамоново',
        'lat' => '54.4645591',
        'long' => '19.9454114',
    ],
    'cities561' => [
        'name' => 'Мантурово',
        'lat' => '58.3264667',
        'long' => '44.7575036',
    ],
    'cities562' => [
        'name' => 'Мариинск',
        'lat' => '56.2127836',
        'long' => '87.7454392',
    ],
    'cities563' => [
        'name' => 'Мариинский Посад',
        'lat' => '56.111968',
        'long' => '47.7142676',
    ],
    'cities564' => [
        'name' => 'Маркс',
        'lat' => '51.7133973',
        'long' => '46.7400684',
    ],
    'cities565' => [
        'name' => 'Махачкала',
        'lat' => '42.9848572',
        'long' => '47.5046303',
    ],
    'cities566' => [
        'name' => 'Мглин',
        'lat' => '53.0600644',
        'long' => '32.8467217',
    ],
    'cities567' => [
        'name' => 'Мегион',
        'lat' => '61.0318946',
        'long' => '76.1024772',
    ],
    'cities568' => [
        'name' => 'Медвежьегорск',
        'lat' => '62.9127678',
        'long' => '34.4567614',
    ],
    'cities569' => [
        'name' => 'Медногорск',
        'lat' => '51.4039421',
        'long' => '57.5832185',
    ],
    'cities570' => [
        'name' => 'Медынь',
        'lat' => '54.9690755',
        'long' => '35.887313',
    ],
    'cities571' => [
        'name' => 'Межгорье',
        'lat' => '54.239683',
        'long' => '57.96146',
    ],
    'cities572' => [
        'name' => 'Междуреченск',
        'lat' => '53.6865695',
        'long' => '88.0703888',
    ],
    'cities573' => [
        'name' => 'Мезень',
        'lat' => '65.8398386',
        'long' => '44.2531865',
    ],
    'cities574' => [
        'name' => 'Меленки',
        'lat' => '55.3387017',
        'long' => '41.634124',
    ],
    'cities575' => [
        'name' => 'Мелеуз',
        'lat' => '52.9590637',
        'long' => '55.9283483',
    ],
    'cities576' => [
        'name' => 'Менделеевск',
        'lat' => '55.8950646',
        'long' => '52.3144177',
    ],
    'cities577' => [
        'name' => 'Мензелинск',
        'lat' => '55.7270908',
        'long' => '53.1005321',
    ],
    'cities578' => [
        'name' => 'Мещовск',
        'lat' => '54.3191127',
        'long' => '35.2816065',
    ],
    'cities579' => [
        'name' => 'Миасс',
        'lat' => '55.0455774',
        'long' => '60.1077757',
    ],
    'cities580' => [
        'name' => 'Микунь',
        'lat' => '62.3580188',
        'long' => '50.0719738',
    ],
    'cities581' => [
        'name' => 'Миллерово',
        'lat' => '48.925821',
        'long' => '40.3983302',
    ],
    'cities582' => [
        'name' => 'Минеральные Воды',
        'lat' => '44.2088942',
        'long' => '43.1383482',
    ],
    'cities583' => [
        'name' => 'Минусинск',
        'lat' => '53.7105509',
        'long' => '91.6871866',
    ],
    'cities584' => [
        'name' => 'Миньяр',
        'lat' => '55.0709601',
        'long' => '57.5484435',
    ],
    'cities585' => [
        'name' => 'Мирный',
        'lat' => '62.7644267',
        'long' => '40.3359976',
    ],
    'cities586' => [
        'name' => 'Мирный',
        'lat' => '62.5362511',
        'long' => '113.9668146',
    ],
    'cities587' => [
        'name' => 'Михайлов',
        'lat' => '54.2296493',
        'long' => '39.0090857',
    ],
    'cities588' => [
        'name' => 'Михайловка',
        'lat' => '50.0708749',
        'long' => '43.2400847',
    ],
    'cities589' => [
        'name' => 'Михайловск',
        'lat' => '56.4369736',
        'long' => '59.113865',
    ],
    'cities590' => [
        'name' => 'Михайловск',
        'lat' => '45.1296297',
        'long' => '42.028787',
    ],
    'cities591' => [
        'name' => 'Мичуринск',
        'lat' => '52.891294',
        'long' => '40.510475',
    ],
    'cities592' => [
        'name' => 'Могоча',
        'lat' => '53.7362465',
        'long' => '119.7661232',
    ],
    'cities593' => [
        'name' => 'Можайск',
        'lat' => '55.5069819',
        'long' => '36.0240724',
    ],
    'cities594' => [
        'name' => 'Можга',
        'lat' => '56.4427219',
        'long' => '52.2138882',
    ],
    'cities595' => [
        'name' => 'Моздок',
        'lat' => '43.7471209',
        'long' => '44.6571456',
    ],
    'cities596' => [
        'name' => 'Мончегорск',
        'lat' => '67.9385206',
        'long' => '32.9358886',
    ],
    'cities597' => [
        'name' => 'Морозовск',
        'lat' => '48.3511724',
        'long' => '41.8308006',
    ],
    'cities598' => [
        'name' => 'Моршанск',
        'lat' => '53.4436469',
        'long' => '41.8115687',
    ],
    'cities599' => [
        'name' => 'Мосальск',
        'lat' => '54.4825589',
        'long' => '34.987206',
    ],
    'cities600' => [
        'name' => 'Муравленко',
        'lat' => '63.794188',
        'long' => '74.494913',
    ],
    'cities601' => [
        'name' => 'Мураши',
        'lat' => '59.3956347',
        'long' => '48.9637651',
    ],
    'cities602' => [
        'name' => 'Мурманск',
        'lat' => '69.0076958',
        'long' => '33.0686019',
    ],
    'cities603' => [
        'name' => 'Муром',
        'lat' => '55.5632276',
        'long' => '42.023006',
    ],
    'cities604' => [
        'name' => 'Мценск',
        'lat' => '53.2790021',
        'long' => '36.574992',
    ],
    'cities605' => [
        'name' => 'Мыски',
        'lat' => '53.7125516',
        'long' => '87.8056657',
    ],
    'cities606' => [
        'name' => 'Мытищи',
        'lat' => '55.9104647',
        'long' => '37.7363702',
    ],
    'cities607' => [
        'name' => 'Мышкин',
        'lat' => '57.7881664',
        'long' => '38.4542816',
    ],
    'cities608' => [
        'name' => 'Набережные Челны',
        'lat' => '55.7436475',
        'long' => '52.3958739',
    ],
    'cities609' => [
        'name' => 'Навашино',
        'lat' => '55.5439105',
        'long' => '42.1887734',
    ],
    'cities610' => [
        'name' => 'Наволоки',
        'lat' => '57.4678426',
        'long' => '41.9607371',
    ],
    'cities611' => [
        'name' => 'Надым',
        'lat' => '65.5377514',
        'long' => '72.5182746',
    ],
    'cities612' => [
        'name' => 'Назарово',
        'lat' => '56.0113176',
        'long' => '90.4167947',
    ],
    'cities613' => [
        'name' => 'Назрань',
        'lat' => '43.2257977',
        'long' => '44.764685',
    ],
    'cities614' => [
        'name' => 'Называевск',
        'lat' => '55.5688811',
        'long' => '71.3502572',
    ],
    'cities615' => [
        'name' => 'Нальчик',
        'lat' => '43.4846312',
        'long' => '43.6070316',
    ],
    'cities616' => [
        'name' => 'Нариманов',
        'lat' => '46.6916597',
        'long' => '47.8501624',
    ],
    'cities617' => [
        'name' => 'Наро-Фоминск',
        'lat' => '55.3802749',
        'long' => '36.7608038',
    ],
    'cities618' => [
        'name' => 'Нарткала',
        'lat' => '43.5577208',
        'long' => '43.8576411',
    ],
    'cities619' => [
        'name' => 'Нарьян-Мар',
        'lat' => '67.6381525',
        'long' => '53.0069336',
    ],
    'cities620' => [
        'name' => 'Находка',
        'lat' => '42.8240404',
        'long' => '132.8927812',
    ],
    'cities621' => [
        'name' => 'Невель',
        'lat' => '56.0201544',
        'long' => '29.9240505',
    ],
    'cities622' => [
        'name' => 'Невельск',
        'lat' => '46.6527314',
        'long' => '141.8631741',
    ],
    'cities623' => [
        'name' => 'Невинномысск',
        'lat' => '44.6227404',
        'long' => '41.9476147',
    ],
    'cities624' => [
        'name' => 'Невьянск',
        'lat' => '57.491233',
        'long' => '60.2181839',
    ],
    'cities625' => [
        'name' => 'Нелидово',
        'lat' => '56.2232417',
        'long' => '32.7766656',
    ],
    'cities626' => [
        'name' => 'Неман',
        'lat' => '55.0315543',
        'long' => '22.0323961',
    ],
    'cities627' => [
        'name' => 'Нерехта',
        'lat' => '57.4543706',
        'long' => '40.5725438',
    ],
    'cities628' => [
        'name' => 'Нерчинск',
        'lat' => '51.9595512',
        'long' => '116.5854018',
    ],
    'cities629' => [
        'name' => 'Нерюнгри',
        'lat' => '56.6600322',
        'long' => '124.72031',
    ],
    'cities630' => [
        'name' => 'Нестеров',
        'lat' => '54.6314454',
        'long' => '22.5713658',
    ],
    'cities631' => [
        'name' => 'Нефтегорск',
        'lat' => '52.797259',
        'long' => '51.1637126',
    ],
    'cities632' => [
        'name' => 'Нефтекамск',
        'lat' => '56.0883075',
        'long' => '54.2483391',
    ],
    'cities633' => [
        'name' => 'Нефтекумск',
        'lat' => '44.7544866',
        'long' => '44.9865041',
    ],
    'cities634' => [
        'name' => 'Нефтеюганск',
        'lat' => '61.0882837',
        'long' => '72.6164185',
    ],
    'cities635' => [
        'name' => 'Нея',
        'lat' => '58.2944499',
        'long' => '43.8780965',
    ],
    'cities636' => [
        'name' => 'Нижневартовск',
        'lat' => '60.9397379',
        'long' => '76.5696206',
    ],
    'cities637' => [
        'name' => 'Нижнекамск',
        'lat' => '55.6311963',
        'long' => '51.814407',
    ],
    'cities638' => [
        'name' => 'Нижнеудинск',
        'lat' => '54.8969105',
        'long' => '99.0313481',
    ],
    'cities639' => [
        'name' => 'Нижние Серги',
        'lat' => '56.6544606',
        'long' => '59.2952291',
    ],
    'cities640' => [
        'name' => 'Нижний Ломов',
        'lat' => '53.5301274',
        'long' => '43.6729216',
    ],
    'cities641' => [
        'name' => 'Нижний Новгород',
        'lat' => '56.3242093',
        'long' => '44.0053948',
    ],
    'cities642' => [
        'name' => 'Нижний Тагил',
        'lat' => '57.9101038',
        'long' => '59.9813242',
    ],
    'cities643' => [
        'name' => 'Нижняя Салда',
        'lat' => '58.0749243',
        'long' => '60.7026555',
    ],
    'cities644' => [
        'name' => 'Нижняя Тура',
        'lat' => '58.6310942',
        'long' => '59.8521265',
    ],
    'cities645' => [
        'name' => 'Николаевск',
        'lat' => '50.0166952',
        'long' => '45.4733204',
    ],
    'cities646' => [
        'name' => 'Николаевск-на-Амуре',
        'lat' => '53.1461943',
        'long' => '140.7109642',
    ],
    'cities647' => [
        'name' => 'Никольск',
        'lat' => '59.5350162',
        'long' => '45.4575468',
    ],
    'cities648' => [
        'name' => 'Никольск',
        'lat' => '53.7138397',
        'long' => '46.079962',
    ],
    'cities649' => [
        'name' => 'Никольское',
        'lat' => '59.7042633',
        'long' => '30.7874879',
    ],
    'cities650' => [
        'name' => 'Новая Ладога',
        'lat' => '60.1100013',
        'long' => '32.3141446',
    ],
    'cities651' => [
        'name' => 'Новая Ляля',
        'lat' => '59.053961',
        'long' => '60.5945405',
    ],
    'cities652' => [
        'name' => 'Новоалександровск',
        'lat' => '45.4933561',
        'long' => '41.2154482',
    ],
    'cities653' => [
        'name' => 'Новоалтайск',
        'lat' => '53.4120811',
        'long' => '83.9311249',
    ],
    'cities654' => [
        'name' => 'Новоаннинский',
        'lat' => '50.5296873',
        'long' => '42.6666038',
    ],
    'cities655' => [
        'name' => 'Нововоронеж',
        'lat' => '51.3092463',
        'long' => '39.2162865',
    ],
    'cities656' => [
        'name' => 'Новодвинск',
        'lat' => '64.4136023',
        'long' => '40.8208003',
    ],
    'cities657' => [
        'name' => 'Новозыбков',
        'lat' => '52.5371426',
        'long' => '31.9356826',
    ],
    'cities658' => [
        'name' => 'Новокубанск',
        'lat' => '45.1038782',
        'long' => '41.0473679',
    ],
    'cities659' => [
        'name' => 'Новокузнецк',
        'lat' => '53.7942757',
        'long' => '87.2144046',
    ],
    'cities660' => [
        'name' => 'Новокуйбышевск',
        'lat' => '53.0995303',
        'long' => '49.9477662',
    ],
    'cities661' => [
        'name' => 'Новомичуринск',
        'lat' => '54.0377979',
        'long' => '39.7467023',
    ],
    'cities662' => [
        'name' => 'Новомосковск',
        'lat' => '54.0109754',
        'long' => '38.2915652',
    ],
    'cities663' => [
        'name' => 'Новопавловск',
        'lat' => '43.9617565',
        'long' => '43.6342855',
    ],
    'cities664' => [
        'name' => 'Новоржев',
        'lat' => '57.0298332',
        'long' => '29.343333',
    ],
    'cities665' => [
        'name' => 'Новороссийск',
        'lat' => '44.7234264',
        'long' => '37.7687218',
    ],
    'cities666' => [
        'name' => 'Новосибирск',
        'lat' => '55.0281016',
        'long' => '82.9210575',
    ],
    'cities667' => [
        'name' => 'Новосиль',
        'lat' => '52.9747225',
        'long' => '37.0438402',
    ],
    'cities668' => [
        'name' => 'Новосокольники',
        'lat' => '56.3407627',
        'long' => '30.1527712',
    ],
    'cities669' => [
        'name' => 'Новотроицк',
        'lat' => '51.1965071',
        'long' => '58.3017455',
    ],
    'cities670' => [
        'name' => 'Новоузенск',
        'lat' => '50.4551744',
        'long' => '48.1412622',
    ],
    'cities671' => [
        'name' => 'Новоульяновск',
        'lat' => '54.1447691',
        'long' => '48.3911701',
    ],
    'cities672' => [
        'name' => 'Новоуральск',
        'lat' => '57.2471507',
        'long' => '60.095701',
    ],
    'cities673' => [
        'name' => 'Новохоперск',
        'lat' => '51.0953461',
        'long' => '41.6173714',
    ],
    'cities674' => [
        'name' => 'Новочебоксарск',
        'lat' => '56.109486',
        'long' => '47.4791429',
    ],
    'cities675' => [
        'name' => 'Новочеркасск',
        'lat' => '47.4119248',
        'long' => '40.1042066',
    ],
    'cities676' => [
        'name' => 'Новошахтинск',
        'lat' => '47.7576522',
        'long' => '39.9364709',
    ],
    'cities677' => [
        'name' => 'Новый Оскол',
        'lat' => '50.7635162',
        'long' => '37.8774026',
    ],
    'cities678' => [
        'name' => 'Новый Уренгой',
        'lat' => '66.0840036',
        'long' => '76.6810032',
    ],
    'cities679' => [
        'name' => 'Ногинск',
        'lat' => '55.8686239',
        'long' => '38.4621635',
    ],
    'cities680' => [
        'name' => 'Нолинск',
        'lat' => '57.5596946',
        'long' => '49.9357867',
    ],
    'cities681' => [
        'name' => 'Норильск',
        'lat' => '69.3490828',
        'long' => '88.2009965',
    ],
    'cities682' => [
        'name' => 'Ноябрьск',
        'lat' => '63.201846',
        'long' => '75.4509665',
    ],
    'cities683' => [
        'name' => 'Нурлат',
        'lat' => '54.4281578',
        'long' => '50.8050431',
    ],
    'cities684' => [
        'name' => 'Нытва',
        'lat' => '57.9337429',
        'long' => '55.3357261',
    ],
    'cities685' => [
        'name' => 'Нюрба',
        'lat' => '63.2828775',
        'long' => '118.324325',
    ],
    'cities686' => [
        'name' => 'Нягань',
        'lat' => '62.1454839',
        'long' => '65.3944361',
    ],
    'cities687' => [
        'name' => 'Нязепетровск',
        'lat' => '56.0537199',
        'long' => '59.6096791',
    ],
    'cities688' => [
        'name' => 'Няндома',
        'lat' => '61.6653735',
        'long' => '40.2061699',
    ],
    'cities689' => [
        'name' => 'Облучье',
        'lat' => '49.0188344',
        'long' => '131.0539984',
    ],
    'cities690' => [
        'name' => 'Обнинск',
        'lat' => '55.0943892',
        'long' => '36.6121785',
    ],
    'cities691' => [
        'name' => 'Обоянь',
        'lat' => '51.212012',
        'long' => '36.275425',
    ],
    'cities692' => [
        'name' => 'Обь',
        'lat' => '54.9945882',
        'long' => '82.6937925',
    ],
    'cities693' => [
        'name' => 'Одинцово',
        'lat' => '55.6789292',
        'long' => '37.2636389',
    ],
    'cities694' => [
        'name' => 'Озерск',
        'lat' => '54.4084804',
        'long' => '22.013508',
    ],
    'cities695' => [
        'name' => 'Озерск',
        'lat' => '55.7631922',
        'long' => '60.7076337',
    ],
    'cities696' => [
        'name' => 'Озеры',
        'lat' => '54.8539944',
        'long' => '38.55987',
    ],
    'cities697' => [
        'name' => 'Октябрьск',
        'lat' => '53.1640886',
        'long' => '48.6707463',
    ],
    'cities698' => [
        'name' => 'Октябрьский',
        'lat' => '54.4815344',
        'long' => '53.4656611',
    ],
    'cities699' => [
        'name' => 'Окуловка',
        'lat' => '58.3908717',
        'long' => '33.2902474',
    ],
    'cities700' => [
        'name' => 'Олекминск',
        'lat' => '60.3758203',
        'long' => '120.406013',
    ],
    'cities701' => [
        'name' => 'Оленегорск',
        'lat' => '68.1422068',
        'long' => '33.2670094',
    ],
    'cities702' => [
        'name' => 'Олонец',
        'lat' => '60.9793604',
        'long' => '32.9726031',
    ],
    'cities703' => [
        'name' => 'Омск',
        'lat' => '54.9848136',
        'long' => '73.3674638',
    ],
    'cities704' => [
        'name' => 'Омутнинск',
        'lat' => '58.6697684',
        'long' => '52.1893554',
    ],
    'cities705' => [
        'name' => 'Онега',
        'lat' => '63.9163966',
        'long' => '38.0805749',
    ],
    'cities706' => [
        'name' => 'Опочка',
        'lat' => '56.7107956',
        'long' => '28.6717455',
    ],
    'cities707' => [
        'name' => 'Орёл',
        'lat' => '52.9672573',
        'long' => '36.0696479',
    ],
    'cities708' => [
        'name' => 'Оренбург',
        'lat' => '51.7875191',
        'long' => '55.1017379',
    ],
    'cities709' => [
        'name' => 'Орехово-Зуево',
        'lat' => '55.8151729',
        'long' => '38.9870711',
    ],
    'cities710' => [
        'name' => 'Орлов',
        'lat' => '58.5389402',
        'long' => '48.8929268',
    ],
    'cities711' => [
        'name' => 'Орск',
        'lat' => '51.2293069',
        'long' => '58.4751889',
    ],
    'cities712' => [
        'name' => 'Оса',
        'lat' => '57.2889992',
        'long' => '55.4688982',
    ],
    'cities713' => [
        'name' => 'Осинники',
        'lat' => '53.5987397',
        'long' => '87.3369948',
    ],
    'cities714' => [
        'name' => 'Осташков',
        'lat' => '57.1457205',
        'long' => '33.1116707',
    ],
    'cities715' => [
        'name' => 'Остров',
        'lat' => '57.3452408',
        'long' => '28.3437107',
    ],
    'cities716' => [
        'name' => 'Островной',
        'lat' => '68.0509133',
        'long' => '39.5076034',
    ],
    'cities717' => [
        'name' => 'Острогожск',
        'lat' => '50.8678083',
        'long' => '39.0406398',
    ],
    'cities718' => [
        'name' => 'Отрадное',
        'lat' => '59.772596',
        'long' => '30.7988403',
    ],
    'cities719' => [
        'name' => 'Отрадный',
        'lat' => '53.3800609',
        'long' => '51.3438695',
    ],
    'cities720' => [
        'name' => 'Оха',
        'lat' => '53.5868238',
        'long' => '142.941221',
    ],
    'cities721' => [
        'name' => 'Оханск',
        'lat' => '57.7178946',
        'long' => '55.387153',
    ],
    'cities722' => [
        'name' => 'Очер',
        'lat' => '57.8851991',
        'long' => '54.7161756',
    ],
    'cities723' => [
        'name' => 'Павлово',
        'lat' => '55.9797995',
        'long' => '43.0996232',
    ],
    'cities724' => [
        'name' => 'Павловск',
        'lat' => '50.4533684',
        'long' => '40.1369087',
    ],
    'cities725' => [
        'name' => 'Павловский Посад',
        'lat' => '55.7806718',
        'long' => '38.6596047',
    ],
    'cities726' => [
        'name' => 'Палласовка',
        'lat' => '50.0501422',
        'long' => '46.8803355',
    ],
    'cities727' => [
        'name' => 'Партизанск',
        'lat' => '43.1279833',
        'long' => '133.1264754',
    ],
    'cities728' => [
        'name' => 'Певек',
        'lat' => '69.7018051',
        'long' => '170.2999194',
    ],
    'cities729' => [
        'name' => 'Пенза',
        'lat' => '53.1753884',
        'long' => '45.0347408',
    ],
    'cities730' => [
        'name' => 'Первомайск',
        'lat' => '54.8676182',
        'long' => '43.8012829',
    ],
    'cities731' => [
        'name' => 'Первоуральск',
        'lat' => '56.9081665',
        'long' => '59.9429205',
    ],
    'cities732' => [
        'name' => 'Перевоз',
        'lat' => '55.596904',
        'long' => '44.5450268',
    ],
    'cities733' => [
        'name' => 'Пересвет',
        'lat' => '56.4158828',
        'long' => '38.1733567',
    ],
    'cities734' => [
        'name' => 'Переславль-Залесский',
        'lat' => '56.7360435',
        'long' => '38.8543064',
    ],
    'cities735' => [
        'name' => 'Пермь',
        'lat' => '58.0103211',
        'long' => '56.2341778',
    ],
    'cities736' => [
        'name' => 'Пестово',
        'lat' => '58.5973944',
        'long' => '35.8144523',
    ],
    'cities737' => [
        'name' => 'Петров Вал',
        'lat' => '50.1380355',
        'long' => '45.2091455',
    ],
    'cities738' => [
        'name' => 'Петровск',
        'lat' => '52.3093782',
        'long' => '45.3851649',
    ],
    'cities739' => [
        'name' => 'Петровск-Забайкальский',
        'lat' => '51.2748381',
        'long' => '108.8467139',
    ],
    'cities740' => [
        'name' => 'Петрозаводск',
        'lat' => '61.78909',
        'long' => '34.3596263',
    ],
    'cities741' => [
        'name' => 'Петропавловск-Камчатский',
        'lat' => '53.0370213',
        'long' => '158.6559142',
    ],
    'cities742' => [
        'name' => 'Петухово',
        'lat' => '55.0649932',
        'long' => '67.8874369',
    ],
    'cities743' => [
        'name' => 'Петушки',
        'lat' => '55.9297657',
        'long' => '39.4507913',
    ],
    'cities744' => [
        'name' => 'Печора',
        'lat' => '65.1485717',
        'long' => '57.22388',
    ],
    'cities745' => [
        'name' => 'Печоры',
        'lat' => '57.8146689',
        'long' => '27.6222823',
    ],
    'cities746' => [
        'name' => 'Пикалево',
        'lat' => '59.5130655',
        'long' => '34.1773982',
    ],
    'cities747' => [
        'name' => 'Пионерский',
        'lat' => '54.9516927',
        'long' => '20.227697',
    ],
    'cities748' => [
        'name' => 'Питкяранта',
        'lat' => '61.5756886',
        'long' => '31.4641309',
    ],
    'cities749' => [
        'name' => 'Плавск',
        'lat' => '53.7095993',
        'long' => '37.2863144',
    ],
    'cities750' => [
        'name' => 'Пласт',
        'lat' => '54.3691832',
        'long' => '60.8152305',
    ],
    'cities751' => [
        'name' => 'Плес',
        'lat' => '57.4605304',
        'long' => '41.512301',
    ],
    'cities752' => [
        'name' => 'Поворино',
        'lat' => '51.1953446',
        'long' => '42.2472432',
    ],
    'cities753' => [
        'name' => 'Подольск',
        'lat' => '55.4389588',
        'long' => '37.57027',
    ],
    'cities754' => [
        'name' => 'Подпорожье',
        'lat' => '60.9127463',
        'long' => '34.1567832',
    ],
    'cities755' => [
        'name' => 'Покачи',
        'lat' => '61.7421977',
        'long' => '75.5942069',
    ],
    'cities756' => [
        'name' => 'Покров',
        'lat' => '55.9167118',
        'long' => '39.1733641',
    ],
    'cities757' => [
        'name' => 'Покровск',
        'lat' => '61.4843538',
        'long' => '129.1482195',
    ],
    'cities758' => [
        'name' => 'Полевской',
        'lat' => '56.4958085',
        'long' => '60.2366314',
    ],
    'cities759' => [
        'name' => 'Полесск',
        'lat' => '54.8626321',
        'long' => '21.0998148',
    ],
    'cities760' => [
        'name' => 'Полысаево',
        'lat' => '54.6053968',
        'long' => '86.2808803',
    ],
    'cities761' => [
        'name' => 'Полярные Зори',
        'lat' => '67.3730192',
        'long' => '32.497541',
    ],
    'cities762' => [
        'name' => 'Полярный',
        'lat' => '69.1988373',
        'long' => '33.4509985',
    ],
    'cities763' => [
        'name' => 'Поронайск',
        'lat' => '49.2387983',
        'long' => '143.1007104',
    ],
    'cities764' => [
        'name' => 'Порхов',
        'lat' => '57.7764223',
        'long' => '29.5436424',
    ],
    'cities765' => [
        'name' => 'Похвистнево',
        'lat' => '53.6498197',
        'long' => '52.1235517',
    ],
    'cities766' => [
        'name' => 'Почеп',
        'lat' => '52.9154724',
        'long' => '33.4744608',
    ],
    'cities767' => [
        'name' => 'Починок',
        'lat' => '54.4063031',
        'long' => '32.4397914',
    ],
    'cities768' => [
        'name' => 'Пошехонье',
        'lat' => '58.506328',
        'long' => '39.1210034',
    ],
    'cities769' => [
        'name' => 'Правдинск',
        'lat' => '54.4430604',
        'long' => '21.0083638',
    ],
    'cities770' => [
        'name' => 'Приволжск',
        'lat' => '57.3807249',
        'long' => '41.2809239',
    ],
    'cities771' => [
        'name' => 'Приморск',
        'lat' => '54.7311185',
        'long' => '19.9983108',
    ],
    'cities772' => [
        'name' => 'Приморск',
        'lat' => '60.3660787',
        'long' => '28.6135962',
    ],
    'cities773' => [
        'name' => 'Приморско-Ахтарск',
        'lat' => '46.0515',
        'long' => '38.1704654',
    ],
    'cities774' => [
        'name' => 'Приозерск',
        'lat' => '61.03313',
        'long' => '30.15876',
    ],
    'cities775' => [
        'name' => 'Прокопьевск',
        'lat' => '53.8604562',
        'long' => '86.7183428',
    ],
    'cities776' => [
        'name' => 'Пролетарск',
        'lat' => '46.7038968',
        'long' => '41.7274533',
    ],
    'cities777' => [
        'name' => 'Протвино',
        'lat' => '54.8706614',
        'long' => '37.2183307',
    ],
    'cities778' => [
        'name' => 'Прохладный',
        'lat' => '43.7589521',
        'long' => '44.0101936',
    ],
    'cities779' => [
        'name' => 'Псков',
        'lat' => '57.819284',
        'long' => '28.3318188',
    ],
    'cities780' => [
        'name' => 'Пугачев',
        'lat' => '52.0158464',
        'long' => '48.7972652',
    ],
    'cities781' => [
        'name' => 'Пудож',
        'lat' => '61.8059147',
        'long' => '36.5330088',
    ],
    'cities782' => [
        'name' => 'Пустошка',
        'lat' => '56.3375131',
        'long' => '29.3668243',
    ],
    'cities783' => [
        'name' => 'Пучеж',
        'lat' => '56.982075',
        'long' => '43.1683878',
    ],
    'cities784' => [
        'name' => 'Пушкино',
        'lat' => '56.0104548',
        'long' => '37.8471438',
    ],
    'cities785' => [
        'name' => 'Пущино',
        'lat' => '54.832521',
        'long' => '37.6210428',
    ],
    'cities786' => [
        'name' => 'Пыталово',
        'lat' => '57.0637109',
        'long' => '27.9234759',
    ],
    'cities787' => [
        'name' => 'Пыть-Ях',
        'lat' => '60.7585769',
        'long' => '72.8366445',
    ],
    'cities788' => [
        'name' => 'Пятигорск',
        'lat' => '44.0411669',
        'long' => '43.0661091',
    ],
    'cities789' => [
        'name' => 'Радужный',
        'lat' => '55.9961034',
        'long' => '40.3323247',
    ],
    'cities790' => [
        'name' => 'Радужный',
        'lat' => '62.1343067',
        'long' => '77.4584346',
    ],
    'cities791' => [
        'name' => 'Райчихинск',
        'lat' => '49.7941882',
        'long' => '129.4112149',
    ],
    'cities792' => [
        'name' => 'Раменское',
        'lat' => '55.549529',
        'long' => '38.273015',
    ],
    'cities793' => [
        'name' => 'Рассказово',
        'lat' => '52.6537517',
        'long' => '41.8743779',
    ],
    'cities794' => [
        'name' => 'Ревда',
        'lat' => '56.79869',
        'long' => '59.9071464',
    ],
    'cities795' => [
        'name' => 'Реж',
        'lat' => '57.3717914',
        'long' => '61.3833223',
    ],
    'cities796' => [
        'name' => 'Реутов',
        'lat' => '55.758236',
        'long' => '37.8619443',
    ],
    'cities797' => [
        'name' => 'Ржев',
        'lat' => '56.2629393',
        'long' => '34.3291178',
    ],
    'cities798' => [
        'name' => 'Родники',
        'lat' => '57.1024137',
        'long' => '41.7298908',
    ],
    'cities799' => [
        'name' => 'Рославль',
        'lat' => '53.9449601',
        'long' => '32.8479617',
    ],
    'cities800' => [
        'name' => 'Россошь',
        'lat' => '50.170089',
        'long' => '39.6225534',
    ],
    'cities801' => [
        'name' => 'Ростов',
        'lat' => '57.2050177',
        'long' => '39.4378357',
    ],
    'cities802' => [
        'name' => 'Ростов-на-Дону',
        'lat' => '47.2224364',
        'long' => '39.7187866',
    ],
    'cities803' => [
        'name' => 'Рошаль',
        'lat' => '55.6632504',
        'long' => '39.8655434',
    ],
    'cities804' => [
        'name' => 'Ртищево',
        'lat' => '52.2616298',
        'long' => '43.7842399',
    ],
    'cities805' => [
        'name' => 'Рубцовск',
        'lat' => '51.5013075',
        'long' => '81.2077729',
    ],
    'cities806' => [
        'name' => 'Рудня',
        'lat' => '54.9441357',
        'long' => '31.0794758',
    ],
    'cities807' => [
        'name' => 'Руза',
        'lat' => '55.7015302',
        'long' => '36.1960043',
    ],
    'cities808' => [
        'name' => 'Рузаевка',
        'lat' => '54.0583238',
        'long' => '44.949116',
    ],
    'cities809' => [
        'name' => 'Рыбинск',
        'lat' => '58.0483802',
        'long' => '38.858338',
    ],
    'cities810' => [
        'name' => 'Рыбное',
        'lat' => '54.7255937',
        'long' => '39.513438',
    ],
    'cities811' => [
        'name' => 'Рыльск',
        'lat' => '51.568165',
        'long' => '34.6802178',
    ],
    'cities812' => [
        'name' => 'Ряжск',
        'lat' => '53.7067718',
        'long' => '40.0521358',
    ],
    'cities813' => [
        'name' => 'Рязань',
        'lat' => '54.625457',
        'long' => '39.7359992',
    ],
    'cities814' => [
        'name' => 'Саки',
        'lat' => '45.1342889',
        'long' => '33.6032508',
    ],
    'cities815' => [
        'name' => 'Салават',
        'lat' => '53.3616311',
        'long' => '55.9245559',
    ],
    'cities816' => [
        'name' => 'Салаир',
        'lat' => '54.2351588',
        'long' => '85.8029215',
    ],
    'cities817' => [
        'name' => 'Салехард',
        'lat' => '66.5493568',
        'long' => '66.6083994',
    ],
    'cities818' => [
        'name' => 'Сальск',
        'lat' => '46.4751689',
        'long' => '41.5412229',
    ],
    'cities819' => [
        'name' => 'Самара',
        'lat' => '53.1951657',
        'long' => '50.1067691',
    ],
    'cities820' => [
        'name' => 'Саранск',
        'lat' => '54.1807601',
        'long' => '45.1862263',
    ],
    'cities821' => [
        'name' => 'Сарапул',
        'lat' => '56.4616117',
        'long' => '53.8036967',
    ],
    'cities822' => [
        'name' => 'Саратов',
        'lat' => '51.530376',
        'long' => '45.9530257',
    ],
    'cities823' => [
        'name' => 'Саров',
        'lat' => '54.9227002',
        'long' => '43.3447792',
    ],
    'cities824' => [
        'name' => 'Сасово',
        'lat' => '54.350807',
        'long' => '41.9117458',
    ],
    'cities825' => [
        'name' => 'Сатка',
        'lat' => '55.0404497',
        'long' => '59.0288153',
    ],
    'cities826' => [
        'name' => 'Сафоново',
        'lat' => '55.1199868',
        'long' => '33.233799',
    ],
    'cities827' => [
        'name' => 'Саяногорск',
        'lat' => '53.1008226',
        'long' => '91.4121643',
    ],
    'cities828' => [
        'name' => 'Саянск',
        'lat' => '54.1107787',
        'long' => '102.1802563',
    ],
    'cities829' => [
        'name' => 'Светлогорск',
        'lat' => '54.9439566',
        'long' => '20.1514789',
    ],
    'cities830' => [
        'name' => 'Светлоград',
        'lat' => '45.3284769',
        'long' => '42.8566923',
    ],
    'cities831' => [
        'name' => 'Светлый',
        'lat' => '54.6774051',
        'long' => '20.1356625',
    ],
    'cities832' => [
        'name' => 'Светогорск',
        'lat' => '61.1112679',
        'long' => '28.8726666',
    ],
    'cities833' => [
        'name' => 'Свирск',
        'lat' => '53.0842576',
        'long' => '103.3364192',
    ],
    'cities834' => [
        'name' => 'Свободный',
        'lat' => '51.361264',
        'long' => '128.1218995',
    ],
    'cities835' => [
        'name' => 'Себеж',
        'lat' => '56.2907663',
        'long' => '28.4725735',
    ],
    'cities836' => [
        'name' => 'Северобайкальск',
        'lat' => '55.6357165',
        'long' => '109.3362606',
    ],
    'cities837' => [
        'name' => 'Северодвинск',
        'lat' => '64.56253',
        'long' => '39.8182715',
    ],
    'cities838' => [
        'name' => 'Северо-Курильск',
        'lat' => '50.6731056',
        'long' => '156.1280722',
    ],
    'cities839' => [
        'name' => 'Североморск',
        'lat' => '69.0765029',
        'long' => '33.4178354',
    ],
    'cities840' => [
        'name' => 'Североуральск',
        'lat' => '60.1533333',
        'long' => '59.9525274',
    ],
    'cities841' => [
        'name' => 'Северск',
        'lat' => '56.6031143',
        'long' => '84.8809687',
    ],
    'cities842' => [
        'name' => 'Севск',
        'lat' => '52.1484215',
        'long' => '34.4918198',
    ],
    'cities843' => [
        'name' => 'Сегежа',
        'lat' => '63.7437211',
        'long' => '34.3126755',
    ],
    'cities844' => [
        'name' => 'Сельцо',
        'lat' => '53.3738801',
        'long' => '34.1059226',
    ],
    'cities845' => [
        'name' => 'Семенов',
        'lat' => '56.788935',
        'long' => '44.4903571',
    ],
    'cities846' => [
        'name' => 'Семикаракорск',
        'lat' => '47.5177981',
        'long' => '40.811585',
    ],
    'cities847' => [
        'name' => 'Семилуки',
        'lat' => '51.6951846',
        'long' => '39.0189797',
    ],
    'cities848' => [
        'name' => 'Сенгилей',
        'lat' => '53.9590553',
        'long' => '48.7767869',
    ],
    'cities849' => [
        'name' => 'Серафимович',
        'lat' => '49.566286',
        'long' => '42.7360013',
    ],
    'cities850' => [
        'name' => 'Сергач',
        'lat' => '55.5200364',
        'long' => '45.4813193',
    ],
    'cities851' => [
        'name' => 'Сергиев Посад',
        'lat' => '56.3063411',
        'long' => '38.1502568',
    ],
    'cities852' => [
        'name' => 'Сердобск',
        'lat' => '52.4697532',
        'long' => '44.2122688',
    ],
    'cities853' => [
        'name' => 'Серов',
        'lat' => '59.6048651',
        'long' => '60.5752136',
    ],
    'cities854' => [
        'name' => 'Серпухов',
        'lat' => '54.9225396',
        'long' => '37.4032682',
    ],
    'cities855' => [
        'name' => 'Сертолово',
        'lat' => '60.14458',
        'long' => '30.2094595',
    ],
    'cities856' => [
        'name' => 'Сибай',
        'lat' => '52.7205811',
        'long' => '58.6663303',
    ],
    'cities857' => [
        'name' => 'Сим',
        'lat' => '54.9906584',
        'long' => '57.6899045',
    ],
    'cities858' => [
        'name' => 'Симферополь',
        'lat' => '44.9482645',
        'long' => '34.100117',
    ],
    'cities859' => [
        'name' => 'Сковородино',
        'lat' => '53.9871004',
        'long' => '123.943729',
    ],
    'cities860' => [
        'name' => 'Скопин',
        'lat' => '53.8236028',
        'long' => '39.5493286',
    ],
    'cities861' => [
        'name' => 'Славгород',
        'lat' => '52.9993053',
        'long' => '78.6459674',
    ],
    'cities862' => [
        'name' => 'Славск',
        'lat' => '55.0451054',
        'long' => '21.6742294',
    ],
    'cities863' => [
        'name' => 'Славянск-на-Кубани',
        'lat' => '45.2605079',
        'long' => '38.1260725',
    ],
    'cities864' => [
        'name' => 'Сланцы',
        'lat' => '59.1178693',
        'long' => '28.088106',
    ],
    'cities865' => [
        'name' => 'Слободской',
        'lat' => '58.7311934',
        'long' => '50.1670091',
    ],
    'cities866' => [
        'name' => 'Слюдянка',
        'lat' => '51.6562679',
        'long' => '103.7186877',
    ],
    'cities867' => [
        'name' => 'Смоленск',
        'lat' => '54.7867168',
        'long' => '31.8153366',
    ],
    'cities868' => [
        'name' => 'Снежинск',
        'lat' => '56.085232',
        'long' => '60.7324989',
    ],
    'cities869' => [
        'name' => 'Снежногорск',
        'lat' => '69.1921469',
        'long' => '33.2382821',
    ],
    'cities870' => [
        'name' => 'Собинка',
        'lat' => '55.993798',
        'long' => '40.0180034',
    ],
    'cities871' => [
        'name' => 'Советск',
        'lat' => '55.0810474',
        'long' => '21.8886272',
    ],
    'cities872' => [
        'name' => 'Советск',
        'lat' => '57.5841434',
        'long' => '48.9589228',
    ],
    'cities873' => [
        'name' => 'Советск',
        'lat' => '53.9337099',
        'long' => '37.6315517',
    ],
    'cities874' => [
        'name' => 'Советская Гавань',
        'lat' => '48.9664554',
        'long' => '140.2852223',
    ],
    'cities875' => [
        'name' => 'Советский',
        'lat' => '61.3706695',
        'long' => '63.566863',
    ],
    'cities876' => [
        'name' => 'Сокол',
        'lat' => '59.4759156',
        'long' => '40.1114414',
    ],
    'cities877' => [
        'name' => 'Солигалич',
        'lat' => '59.0786729',
        'long' => '42.2877245',
    ],
    'cities878' => [
        'name' => 'Соликамск',
        'lat' => '59.6483518',
        'long' => '56.7710358',
    ],
    'cities879' => [
        'name' => 'Солнечногорск',
        'lat' => '56.2148655',
        'long' => '37.0967653',
    ],
    'cities880' => [
        'name' => 'Сольвычегодск',
        'lat' => '61.3318091',
        'long' => '46.920351',
    ],
    'cities881' => [
        'name' => 'Соль-Илецк',
        'lat' => '51.1634976',
        'long' => '54.9895391',
    ],
    'cities882' => [
        'name' => 'Сольцы',
        'lat' => '58.1201693',
        'long' => '30.309285',
    ],
    'cities883' => [
        'name' => 'Сорочинск',
        'lat' => '52.4265081',
        'long' => '53.1542123',
    ],
    'cities884' => [
        'name' => 'Сорск',
        'lat' => '54.0001451',
        'long' => '90.2595674',
    ],
    'cities885' => [
        'name' => 'Сортавала',
        'lat' => '61.7032216',
        'long' => '30.6917021',
    ],
    'cities886' => [
        'name' => 'Сосенский',
        'lat' => '54.056525',
        'long' => '35.9621458',
    ],
    'cities887' => [
        'name' => 'Сосновка',
        'lat' => '56.2533149',
        'long' => '51.2833412',
    ],
    'cities888' => [
        'name' => 'Сосновоборск',
        'lat' => '56.1202088',
        'long' => '93.3353411',
    ],
    'cities889' => [
        'name' => 'Сосновый Бор',
        'lat' => '59.8772921',
        'long' => '29.1290866',
    ],
    'cities890' => [
        'name' => 'Сосногорск',
        'lat' => '63.5990137',
        'long' => '53.8762792',
    ],
    'cities891' => [
        'name' => 'Сочи',
        'lat' => '43.5855829',
        'long' => '39.7231419',
    ],
    'cities892' => [
        'name' => 'Спас-Деменск',
        'lat' => '54.4099201',
        'long' => '34.0190263',
    ],
    'cities893' => [
        'name' => 'Спас-Клепики',
        'lat' => '55.1291472',
        'long' => '40.1745036',
    ],
    'cities894' => [
        'name' => 'Спасск',
        'lat' => '53.927163',
        'long' => '43.1860475',
    ],
    'cities895' => [
        'name' => 'Спасск-Дальний',
        'lat' => '44.5900929',
        'long' => '132.8157564',
    ],
    'cities896' => [
        'name' => 'Спасск-Рязанский',
        'lat' => '54.4071497',
        'long' => '40.3764367',
    ],
    'cities897' => [
        'name' => 'Среднеколымск',
        'lat' => '67.4581664',
        'long' => '153.7069511',
    ],
    'cities898' => [
        'name' => 'Среднеуральск',
        'lat' => '56.991883',
        'long' => '60.4771953',
    ],
    'cities899' => [
        'name' => 'Сретенск',
        'lat' => '52.2462356',
        'long' => '117.7116971',
    ],
    'cities900' => [
        'name' => 'Ставрополь',
        'lat' => '45.0445439',
        'long' => '41.9690168',
    ],
    'cities901' => [
        'name' => 'Старая Купавна',
        'lat' => '55.8038411',
        'long' => '38.1426144',
    ],
    'cities902' => [
        'name' => 'Старая Русса',
        'lat' => '57.9906873',
        'long' => '31.3555076',
    ],
    'cities903' => [
        'name' => 'Старица',
        'lat' => '56.514955',
        'long' => '34.9335145',
    ],
    'cities904' => [
        'name' => 'Стародуб',
        'lat' => '52.5851881',
        'long' => '32.7603628',
    ],
    'cities905' => [
        'name' => 'Старый Крым',
        'lat' => '45.0290659',
        'long' => '35.0900885',
    ],
    'cities906' => [
        'name' => 'Старый Оскол',
        'lat' => '51.2965991',
        'long' => '37.8349849',
    ],
    'cities907' => [
        'name' => 'Стерлитамак',
        'lat' => '53.6302498',
        'long' => '55.9315707',
    ],
    'cities908' => [
        'name' => 'Стрежевой',
        'lat' => '60.7328199',
        'long' => '77.6040323',
    ],
    'cities909' => [
        'name' => 'Строитель',
        'lat' => '50.7845571',
        'long' => '36.4886619',
    ],
    'cities910' => [
        'name' => 'Струнино',
        'lat' => '56.3750001',
        'long' => '38.583938',
    ],
    'cities911' => [
        'name' => 'Ступино',
        'lat' => '54.9238403',
        'long' => '38.1186976',
    ],
    'cities912' => [
        'name' => 'Суворов',
        'lat' => '54.1345367',
        'long' => '36.4806933',
    ],
    'cities913' => [
        'name' => 'Судак',
        'lat' => '44.8505913',
        'long' => '34.9761591',
    ],
    'cities914' => [
        'name' => 'Суджа',
        'lat' => '51.1919711',
        'long' => '35.2719619',
    ],
    'cities915' => [
        'name' => 'Судогда',
        'lat' => '55.949897',
        'long' => '40.8563392',
    ],
    'cities916' => [
        'name' => 'Суздаль',
        'lat' => '56.4273814',
        'long' => '40.4525581',
    ],
    'cities917' => [
        'name' => 'Суоярви',
        'lat' => '62.0787769',
        'long' => '32.3499029',
    ],
    'cities918' => [
        'name' => 'Сураж',
        'lat' => '53.0171239',
        'long' => '32.3938351',
    ],
    'cities919' => [
        'name' => 'Сургут',
        'lat' => '61.2539773',
        'long' => '73.3961726',
    ],
    'cities920' => [
        'name' => 'Суровикино',
        'lat' => '48.6189756',
        'long' => '42.8541308',
    ],
    'cities921' => [
        'name' => 'Сурск',
        'lat' => '53.0760597',
        'long' => '45.6911897',
    ],
    'cities922' => [
        'name' => 'Сусуман',
        'lat' => '62.7804628',
        'long' => '148.154033',
    ],
    'cities923' => [
        'name' => 'Сухиничи',
        'lat' => '54.0973787',
        'long' => '35.3443077',
    ],
    'cities924' => [
        'name' => 'Сухой Лог',
        'lat' => '56.9075938',
        'long' => '62.0358708',
    ],
    'cities925' => [
        'name' => 'Сызрань',
        'lat' => '53.1557213',
        'long' => '48.4745419',
    ],
    'cities926' => [
        'name' => 'Сыктывкар',
        'lat' => '61.668789',
        'long' => '50.8356491',
    ],
    'cities927' => [
        'name' => 'Сысерть',
        'lat' => '56.50052',
        'long' => '60.8190708',
    ],
    'cities928' => [
        'name' => 'Сычевка',
        'lat' => '55.8307397',
        'long' => '34.277868',
    ],
    'cities929' => [
        'name' => 'Сясьстрой',
        'lat' => '60.1402454',
        'long' => '32.5602015',
    ],
    'cities930' => [
        'name' => 'Тавда',
        'lat' => '58.0434196',
        'long' => '65.2743232',
    ],
    'cities931' => [
        'name' => 'Таганрог',
        'lat' => '47.2094907',
        'long' => '38.935154',
    ],
    'cities932' => [
        'name' => 'Тайга',
        'lat' => '56.0622767',
        'long' => '85.6207907',
    ],
    'cities933' => [
        'name' => 'Тайшет',
        'lat' => '55.9405397',
        'long' => '98.0030649',
    ],
    'cities934' => [
        'name' => 'Талдом',
        'lat' => '56.7308993',
        'long' => '37.5276414',
    ],
    'cities935' => [
        'name' => 'Талица',
        'lat' => '57.0123359',
        'long' => '63.7322467',
    ],
    'cities936' => [
        'name' => 'Тамбов',
        'lat' => '52.7213021',
        'long' => '41.452258',
    ],
    'cities937' => [
        'name' => 'Тара',
        'lat' => '56.9159171',
        'long' => '74.3649643',
    ],
    'cities938' => [
        'name' => 'Тарко-Сале',
        'lat' => '64.9117649',
        'long' => '77.7610204',
    ],
    'cities939' => [
        'name' => 'Таруса',
        'lat' => '54.7236791',
        'long' => '37.1670866',
    ],
    'cities940' => [
        'name' => 'Татарск',
        'lat' => '55.2145894',
        'long' => '75.9740805',
    ],
    'cities941' => [
        'name' => 'Таштагол',
        'lat' => '52.7594505',
        'long' => '87.8477272',
    ],
    'cities942' => [
        'name' => 'Тверь',
        'lat' => '56.8585396',
        'long' => '35.9117898',
    ],
    'cities943' => [
        'name' => 'Теберда',
        'lat' => '43.4438408',
        'long' => '41.7414924',
    ],
    'cities944' => [
        'name' => 'Тейково',
        'lat' => '56.8542712',
        'long' => '40.5355289',
    ],
    'cities945' => [
        'name' => 'Темников',
        'lat' => '54.6309086',
        'long' => '43.2161785',
    ],
    'cities946' => [
        'name' => 'Темрюк',
        'lat' => '45.2611082',
        'long' => '37.445519',
    ],
    'cities947' => [
        'name' => 'Терек',
        'lat' => '43.4838439',
        'long' => '44.1402524',
    ],
    'cities948' => [
        'name' => 'Тетюши',
        'lat' => '54.936575',
        'long' => '48.8314915',
    ],
    'cities949' => [
        'name' => 'Тимашевск',
        'lat' => '45.6159358',
        'long' => '38.9350513',
    ],
    'cities950' => [
        'name' => 'Тихвин',
        'lat' => '59.6273809',
        'long' => '33.5072307',
    ],
    'cities951' => [
        'name' => 'Тихорецк',
        'lat' => '45.8546953',
        'long' => '40.1258702',
    ],
    'cities952' => [
        'name' => 'Тобольск',
        'lat' => '58.2016828',
        'long' => '68.2538392',
    ],
    'cities953' => [
        'name' => 'Тогучин',
        'lat' => '55.2250038',
        'long' => '84.4103867',
    ],
    'cities954' => [
        'name' => 'Тольятти',
        'lat' => '53.5206438',
        'long' => '49.389461',
    ],
    'cities955' => [
        'name' => 'Томари',
        'lat' => '47.7619957',
        'long' => '142.061508',
    ],
    'cities956' => [
        'name' => 'Томмот',
        'lat' => '58.9586939',
        'long' => '126.2875375',
    ],
    'cities957' => [
        'name' => 'Томск',
        'lat' => '56.4847036',
        'long' => '84.9481737',
    ],
    'cities958' => [
        'name' => 'Топки',
        'lat' => '55.2766036',
        'long' => '85.6153223',
    ],
    'cities959' => [
        'name' => 'Торжок',
        'lat' => '57.0412804',
        'long' => '34.9600691',
    ],
    'cities960' => [
        'name' => 'Торопец',
        'lat' => '56.5011791',
        'long' => '31.6354366',
    ],
    'cities961' => [
        'name' => 'Тосно',
        'lat' => '59.5406697',
        'long' => '30.8777872',
    ],
    'cities962' => [
        'name' => 'Тотьма',
        'lat' => '59.9735051',
        'long' => '42.7589701',
    ],
    'cities963' => [
        'name' => 'Трехгорный',
        'lat' => '54.8178174',
        'long' => '58.4465039',
    ],
    'cities964' => [
        'name' => 'Троицк',
        'lat' => '54.0844132',
        'long' => '61.5585503',
    ],
    'cities965' => [
        'name' => 'Трубчевск',
        'lat' => '52.5791314',
        'long' => '33.7660013',
    ],
    'cities966' => [
        'name' => 'Туапсе',
        'lat' => '44.1103707',
        'long' => '39.082645',
    ],
    'cities967' => [
        'name' => 'Туймазы',
        'lat' => '54.5999889',
        'long' => '53.6949081',
    ],
    'cities968' => [
        'name' => 'Тула',
        'lat' => '54.192017',
        'long' => '37.6153885',
    ],
    'cities969' => [
        'name' => 'Тулун',
        'lat' => '54.5571409',
        'long' => '100.5779402',
    ],
    'cities970' => [
        'name' => 'Туран',
        'lat' => '52.144932',
        'long' => '93.9172495',
    ],
    'cities971' => [
        'name' => 'Туринск',
        'lat' => '58.0394258',
        'long' => '63.698142',
    ],
    'cities972' => [
        'name' => 'Тутаев',
        'lat' => '57.8674237',
        'long' => '39.5368234',
    ],
    'cities973' => [
        'name' => 'Тында',
        'lat' => '55.1546401',
        'long' => '124.7468634',
    ],
    'cities974' => [
        'name' => 'Тырныауз',
        'lat' => '43.3981939',
        'long' => '42.9215127',
    ],
    'cities975' => [
        'name' => 'Тюкалинск',
        'lat' => '55.8705121',
        'long' => '72.1956156',
    ],
    'cities976' => [
        'name' => 'Тюмень',
        'lat' => '57.1530824',
        'long' => '65.5343118',
    ],
    'cities977' => [
        'name' => 'Уварово',
        'lat' => '51.9768835',
        'long' => '42.2529568',
    ],
    'cities978' => [
        'name' => 'Углегорск',
        'lat' => '49.0816311',
        'long' => '142.0693033',
    ],
    'cities979' => [
        'name' => 'Углич',
        'lat' => '57.5223866',
        'long' => '38.3019793',
    ],
    'cities980' => [
        'name' => 'Удачный',
        'lat' => '66.4072367',
        'long' => '112.3061653',
    ],
    'cities981' => [
        'name' => 'Удомля',
        'lat' => '57.8787885',
        'long' => '35.016716',
    ],
    'cities982' => [
        'name' => 'Ужур',
        'lat' => '55.3141977',
        'long' => '89.8333827',
    ],
    'cities983' => [
        'name' => 'Узловая',
        'lat' => '53.9731407',
        'long' => '38.1763104',
    ],
    'cities984' => [
        'name' => 'Улан-Удэ',
        'lat' => '51.8334378',
        'long' => '107.5841511',
    ],
    'cities985' => [
        'name' => 'Ульяновск',
        'lat' => '54.3080674',
        'long' => '48.3748717',
    ],
    'cities986' => [
        'name' => 'Унеча',
        'lat' => '52.8460665',
        'long' => '32.6757071',
    ],
    'cities987' => [
        'name' => 'Урай',
        'lat' => '60.1295842',
        'long' => '64.8040117',
    ],
    'cities988' => [
        'name' => 'Урень',
        'lat' => '57.4612547',
        'long' => '45.783394',
    ],
    'cities989' => [
        'name' => 'Уржум',
        'lat' => '57.1097612',
        'long' => '50.0056278',
    ],
    'cities990' => [
        'name' => 'Урюпинск',
        'lat' => '50.7904767',
        'long' => '42.0288589',
    ],
    'cities991' => [
        'name' => 'Усинск',
        'lat' => '65.9941116',
        'long' => '57.5570054',
    ],
    'cities992' => [
        'name' => 'Усмань',
        'lat' => '52.0444165',
        'long' => '39.7264516',
    ],
    'cities993' => [
        'name' => 'Усолье',
        'lat' => '59.4279356',
        'long' => '56.6837783',
    ],
    'cities994' => [
        'name' => 'Усолье-Сибирское',
        'lat' => '52.7567192',
        'long' => '103.6387694',
    ],
    'cities995' => [
        'name' => 'Уссурийск',
        'lat' => '43.79726',
        'long' => '131.9517262',
    ],
    'cities996' => [
        'name' => 'Усть-Джегута',
        'lat' => '44.083852',
        'long' => '41.971128',
    ],
    'cities997' => [
        'name' => 'Усть-Илимск',
        'lat' => '57.9431325',
        'long' => '102.7414683',
    ],
    'cities998' => [
        'name' => 'Усть-Катав',
        'lat' => '54.9261323',
        'long' => '58.1528067',
    ],
    'cities999' => [
        'name' => 'Усть-Кут',
        'lat' => '56.7928049',
        'long' => '105.7756883',
    ],
];
